{
  "advice": {
    "e1": {
      "strength": "قدرتك على التروي وضبط النفس قبل الكلام تدل على نضج عاطفي كبير. هذا السلوك يحمي علاقاتك من كلمات قد تندم عليها. حافظ على هذه العادة الذهبية.",
      "weakness": "جرب تقنية العد للعشرة قبل أن ترد في لحظات الغضب. هذه الثواني البسيطة كفيلة بتهدئة جهازك العصبي وتجنبك كلمات قد تندم عليها."
    },
    "e2": {
      "strength": "تقبلك للنقد بصدر رحب وبدون دفاعية يدل على ثقتك العالية بنفسك ورغبتك الصادقة في التطور. هذه من أرقى صفات الناجحين.",
      "weakness": "تذكر أن النقد البناء موجه لسلوكك أو عملك، ليس لشخصك. حاول أن تمتص الفائدة وتتجاهل الأسلوب القاسي أحياناً."
    },
    "e3": {
      "strength": "شجاعتك على الاعتراف بالخطأ والاعتذار بصدق تجعلك كبيراً في عيون الآخرين. الاعتذار لا يقلل من شأنك، بل يرفع مكانتك.",
      "weakness": "الاعتذار ليس ضعفاً. ابدأ بجملة بسيطة: أنا آسف على ما بدر مني، كان خطأً مني. كلما تدربت على الاعتذار، أصبح أسهل."
    },
    "e4": {
      "strength": "امتلاكك لمشاعرك وعدم لوم الآخرين عليها هو قمة الذكاء العاطفي. أنت تعي أن مشاعرك نابعة من داخلك، وهذا وعي عميق.",
      "weakness": "بدلاً من أن تقول أنت تزعجني، جرب أن تقول أنا أشعر بالانزعاج عندما تفعل كذا. بهذه الطريقة أنت تمتلك مشاعرك ولا تلوم الآخر عليها."
    },
    "e5": {
      "strength": "وعيك بالفرق الجوهري بين الحب الناضج والتعلق غير الصحي يحميك من علاقات مؤلمة. الحب يمنح حرية، والتعلق يقيد. حافظ على هذا الفهم.",
      "weakness": "الحب الصحي يمنح الطرف الآخر مساحة وحرية، أما التعلق فيتملك ويخيف. اسأل نفسك: هل تحب أم تتعلق؟ الإجابة ستغير حياتك."
    },
    "e6": {
      "strength": "قدرتك على السيطرة على غيرتك تنبع من ثقتك العالية بنفسك وبالعلاقة. هذه من أجمل صفات الشريك الواثق والآمن.",
      "weakness": "الغيرة غالباً ما تكون صوت انعدام الأمان الداخلي. ركز على تعزيز ثقتك بنفسك من خلال الإنجازات الشخصية، وتذكر أن من يحبك يبقى معك."
    },
    "e7": {
      "strength": "تركيزك على إيجاد حلول بدلاً من إثبات صحة موقفك هو سر نجاح علاقاتك. أنت تبحث عن كيف نخرج من هذا معاً وليس من المنتصر.",
      "weakness": "اسأل نفسك في أي خلاف: ما هو هدفي الحقيقي؟ هل هو إثبات أني على صواب، أم الوصول لحل يرضينا معاً؟ تغيير الهدف يغير النتيجة."
    },
    "e8": {
      "strength": "أنت تملك زمام أمورك ولا تدع الغضب يتحكم فيك. هذه المهارة العاطفية المتقدمة تجعلك شخصاً حكيماً ومحترماً في نظر الآخرين.",
      "weakness": "الغضب الشديد قد يجعلك تفقد السيطرة. جرب التنفس العميق: شهيق لمدة 4 ثوان، احبس النفس 4 ثوان، زفير لمدة 4 ثوان. كرر 5 مرات."
    },
    "e9": {
      "strength": "تعاطفك الصادق مع الآخرين وقدرتك على فهم مشاعرهم تجعلك إنساناً رائعاً ومحبوباً. العالم بحاجة لأمثالك.",
      "weakness": "التعاطف صفة جميلة، لكن لا تجعل مشاعر الآخرين تسيطر عليك. تعلم أن تفرق بين التعاطف والاستغراق العاطفي الزائد."
    },
    "e10": {
      "strength": "قدرتك على تهدئة نفسك ذاتياً عندما تشعر بالانفعال دليل على وعيك العاطفي العالي. استمر في تطوير هذه المهارة بالتأمل أو الرياضة.",
      "weakness": "تعلم تقنيات الاسترخاء مثل التأمل أو اليوجا. حتى 5 دقائق يومياً من التنفس العميق يمكن أن تحسن قدرتك على تهدئة نفسك."
    },
    "e11": {
      "strength": "توازنك في الشعور بالذنب ممتاز. تشعر بالذنب عندما تخطئ، لكنك لا تبالغ في جلد ذاتك. هذا هو النضج العاطفي.",
      "weakness": "فرق بين الذنب المفيد الذي يدفعك للتعويض والتحسن والذنب غير المفيد الذي يظل يلاحقك دون فائدة. تعلم أن تسامح نفسك."
    },
    "e12": {
      "strength": "مسامحتك للآخرين وتصفية قلبك من أي ضغينة يدل على سمو أخلاقك وقوة شخصيتك.",
      "weakness": "المسامحة هدية تقدمها لنفسك قبل الآخر. جرب أن تكتب رسالة إلى من أساء لك لا ترسلها تعبر فيها عن مشاعرك، ثم قم بتمزيقها. هذا يحررك."
    },
    "e13": {
      "strength": "صفاء قلبك من الحقد نعمة عظيمة. حافظ عليها وكن قدوة للآخرين في التسامح والعفو.",
      "weakness": "الضغينة كسم تشربه وأنت تنتظر أن يموت الآخر. أنت أول من يتأذى. قرر أن تسامح وتتخلص من هذا العبء الثقيل."
    },
    "e14": {
      "strength": "قدرتك على التعبير عن مشاعرك بسهولة ووضوح تجنبك سوء الفهم وتجعل علاقاتك أكثر صحة وشفافية.",
      "weakness": "ابدأ بالتعبير عن مشاعرك البسيطة: أنا سعيد، أنا متعب، هذا أعجبني. كلما تدربت على المشاعر البسيطة، أصبح التعبير عن العميقة أسهل."
    },
    "e15": {
      "strength": "قدرتك على كتم مشاعرك في الوقت المناسب تدل على حكمتك، لكن تذكر أن التعبير عن المشاعر مع الأشخاص المقربين يقوي العلاقات.",
      "weakness": "كتمان المشاعر يضر بصحتك النفسية والجسدية. ابحث عن شخص تثق به وشاركه ما تشعر به. التعبير عن المشاعر يخفف وطأتها."
    },
    "e16": {
      "strength": "البكاء ليس ضعفاً، هو تفريغ طبيعي للمشاعر. قدرتك على البكاء تدل على حساسيتك وإنسانيتك.",
      "weakness": "البكاء ليس ضعفاً، هو تفريغ طبيعي للمشاعر. لكن إذا كان مفرطاً، فقد تحتاج لمساعدة مختص لتفهم أسبابه العميقة."
    },
    "e17": {
      "strength": "قدرتك على التعامل مع الوحدة تدل على قوة داخلية هائلة. أنت تدرك أن قيمة الإنسان ليست بعدد الناس حوله.",
      "weakness": "الوحدة لا تعني العزلة. جرب الانضمام لنشاط اجتماعي، أو التطوع، أو الانضمام لدورة في مجال تحبه. الالتقاء بأناس يشاركونك الاهتمامات يبني روابط."
    },
    "e18": {
      "strength": "توازنك في الاعتماد على الآخرين ممتاز. أنت تدرك أن العلاقات الصحية تقوم على التبادل لا التبعية.",
      "weakness": "الاعتماد على النفس عاطفياً مهارة. ابدأ بتلبية احتياجاتك العاطفية بنفسك: امدح نفسك، كافئها، وكن لطيفاً معها."
    },
    "e19": {
      "strength": "وعيك بميلك للتعلق السريع خطوة مهمة جداً. هذا الوعي سيساعدك على بناء علاقات صحية متزنة بدلاً من التعلق غير الآمن.",
      "weakness": "التعلق السريع عادة ما يكون بسبب فراغ عاطفي أو حاجة للأمان. املأ حياتك بهوايات وأهداف وعلاقات متنوعة حتى لا تضع كل احتياجاتك في شخص واحد."
    },
    "e20": {
      "strength": "وعيك بحاجتك للدعم النفسي عند الضرورة يدل على نضجك. طلب المساعدة ليس ضعفاً، بل هو قوة.",
      "weakness": "من الطبيعي أن نحتاج الدعم أحياناً، لكن الاستمرارية تشير لحاجة أعمق. ابدأ ببناء مصادر دعم ذاتي: ثقة بالنفس، هوايات، أهداف شخصية."
    },
    "e21": {
      "strength": "شعورك بالأمان في علاقاتك يدل على ثقتك بنفسك وبالآخرين. هذه الثقة هي أساس العلاقات الصحية والمتينة.",
      "weakness": "الأمان الحقيقي ينبع من داخلك، لا من الآخرين. ابدأ ببناء ثقتك بنفسك من خلال الإنجازات الصغيرة والاعتماد على ذاتك."
    },
    "e22": {
      "strength": "تقبلك للرفض يدل على ثقة عالية بالنفس. أنت تدرك أن الرفض ليس حكماً على قيمتك كإنسان.",
      "weakness": "الرفض ليس حكماً على قيمتك. كل لا تقربك من نعم الصحيحة. تعلم من التجربة وامشِ قدماً، فالرفض جزء طبيعي من الحياة."
    },
    "e23": {
      "strength": "شجاعتك في الالتزام مميزة. أنت تدرك أن الالتزام ليس قيداً، بل هو اختيار واعٍ لمن يستحق.",
      "weakness": "الخوف من الالتزام طبيعي، لكنه قد يحرمك من علاقات عميقة. ابدأ بالتزامات صغيرة مع أشخاص تثق بهم، وزدها تدريجياً."
    },
    "e24": {
      "strength": "ثقتك العالية بالآخرين تجعل الحياة أسهل وتجذب إليك الأشخاص الإيجابيين. لكن ابقَ واقعياً.",
      "weakness": "قبل أن تبني سيناريو كاملاً في رأسك عن نوايا الآخر، اسأله مباشرة بتواضع. ستجد أن معظم الشكوك لا أساس لها من الصحة."
    },
    "e25": {
      "strength": "قدرتك على ترك الماضي والعيش في الحاضر مذهلة. أنت تدرك أن الحياة تحدث الآن، في هذه اللحظة.",
      "weakness": "الماضي انتهى ولا يمكن تغييره. تعلم منه واتركه. كل دقيقة تقضيها في التفكير بالماضي هي دقيقة تسرقها من مستقبلك."
    },
    "e26": {
      "strength": "تخطيطك للمستقبل أمر رائع، لكن تذكر أن تعيش الحاضر أيضاً. التوازن بين التخطيط والاستمتاع هو سر السعادة.",
      "weakness": "التخطيط للمستقبل مهم، لكن لا تنسَ أن تعيش الحاضر. الحياة تحدث الآن، في هذه اللحظة. خصص وقتاً للاستمتاع بما لديك اليوم."
    },
    "e27": {
      "strength": "قدرتك على الاستمتاع باللحظة الحالية تدل على وعيك العالي وامتنانك للنعم الصغيرة. استمر في هذا.",
      "weakness": "تدرب على الامتنان. خصص 5 دقائق قبل النوم لتدوين ثلاثة أشياء بسيطة كنت ممتناً لها اليوم. هذا يدرب عقلك على ملاحظة الجمال."
    },
    "e28": {
      "strength": "قدرتك على قول لا بلطف وحزم دون شعور بالذنب مهارة نادرة تدل على احترامك لذاتك وحدودك.",
      "weakness": "لا جملة كاملة. لا تحتاج لتبرير طويل. قلها بلطف وحزم: لا أستطيع حالياً أو آسف، لا يمكنني."
    },
    "e29": {
      "strength": "تعاملك الصحي مع الندم يدل على نضج عاطفي عالي. أنت تتعلم من أخطائك ولا تجلد ذاتك.",
      "weakness": "الندم شعور طبيعي، لكن لا تدعه يشلك. حول طاقة الندم إلى درس. اسأل نفسك: ماذا تعلمت؟ وكيف سأتخذ قراري القادم بشكل أفضل؟"
    },
    "e30": {
      "strength": "توازنك في لوم الذات ممتاز. هذا سر من أسرار النجاح. أنت تحاسب نفسك دون أن تظلمها.",
      "weakness": "عامل نفسك كما تعامل صديقك المفضل. هل ستقول لصديقك كل هذه الكلمات القاسية؟ كن رحيماً بنفسك."
    },
    "e31": {
      "strength": "قدرتك على تحمل مسؤولية مشاكلك دون لوم الآخرين يدل على نضجك العاطفي ووعيك الذاتي.",
      "weakness": "اسأل نفسك بصدق: ما هو دوري في هذه المشكلة؟ تحمل المسؤولية هو الخطوة الأولى للحل."
    },
    "e32": {
      "strength": "شجاعتك في الاعتراف بالخطأ صفة القادة. الناس تحترم من يعترف بخطئه أكثر ممن يبرره.",
      "weakness": "اعترف بخطئك فوراً ولا تنتظر حتى يكتشفه أحد. الناس تحترم من يعترف بخطئه أكثر ممن يبرره أو ينكره."
    },
    "e33": {
      "strength": "قدرتك على التعلم من الأخطاء أعظم مهارة. أنت تحول كل خطأ إلى فرصة للنمو والتطور.",
      "weakness": "كل خطأ يحمل درساً. اسأل نفسك: ماذا تعلمت؟ وكيف سأتصرف مستقبلاً؟ دوّن إجابتك."
    },
    "e34": {
      "strength": "تعاملك مع الأخطاء ممتاز. أنت تتعلم منها ولا تكررها، وهذا سر تطورك المستمر.",
      "weakness": "توقف وحلل: لماذا أكرر هذا الخطأ؟ ما المشاعر أو الأفكار التي تسبق هذا السلوك؟ أحياناً يكون تكرار الخطأ مؤشراً على حاجة نفسية أعمق."
    },
    "e35": {
      "strength": "وعيك بالعلاقات السامة وقدرتك على تركها تنم عن حكمة كبيرة وحب صادق لذاتك.",
      "weakness": "العلاقة السامة تستنزف طاقتك. اسأل نفسك: هل هذه العلاقة تضفي قيمة لحياتي أم تسلبني سعادتي؟ أحياناً الابتعاد هو الحل الأصح."
    },
    "e36": {
      "strength": "وعيك بعدم التمسك بعلاقة فاشلة يدل على نضجك وحكمتك. أنت تدرك متى حان وقت الرحيل.",
      "weakness": "التمسك بعلاقة فاشلة قد يكون خوفاً من الوحدة أو تغيير. اسأل نفسك: هل هذه العلاقة تضيف لحياتي أم تستنزفني؟"
    },
    "e37": {
      "strength": "حكمتك في اختيار وقت الابتعاد تدل على نضج عاطفي وفهم عميق للعلاقات الإنسانية.",
      "weakness": "تعلم الاستماع لصوتك الداخلي. إذا كنت تشعر باستمرار بالضيق والإرهاق في موقف معين، ربما حان وقت الابتعاد."
    },
    "e38": {
      "strength": "حكمتك في اختيار وقت الإصرار على موقفك تدل على وضوح مبادئك وثباتك.",
      "weakness": "الإصرار في الأمور المصيرية حكمة، وفي الأمور البسيطة عناد. تعلم أن تفرق بينهما."
    },
    "e39": {
      "strength": "توازنك بين العقل والقلب مذهل. هذا التوازن هو سر القرارات الناجحة والعلاقات المتزنة.",
      "weakness": "استشر عقلك في القرارات المصيرية، واستشر قلبك في العلاقات. التوازن بينهما فن. قبل أي قرار مهم، خذ وقتاً للتفكير والتأمل."
    },
    "e40": {
      "strength": "قدرتك على الموازنة بين العاطفة والعقلانية في قراراتك تدل على نضجك وحكمتك.",
      "weakness": "المشاعر مهمة، لكن لا تدعها وحدها تقرر. اكتب إيجابيات وسلبيات أي قرار مهم. هذا التمرين البسيط يُشرك عقلك في العملية."
    },
    "e41": {
      "strength": "عدم تأثرك المفرط بآراء الناس يدل على ثقتك العالية بنفسك ووضوح قيمك ومبادئك.",
      "weakness": "تذكر أن آراء الآخرين عنك تعكس عالمهم هم، ليس عالمك أنت. ركز على ما تعتقده أنت عن نفسك، واجعل هذا هو معيارك الأساسي."
    },
    "e42": {
      "strength": "قدرتك على عدم أخذ الأمور بشكل شخصي نادرة. هذه المهارة تحميك من الكثير من المشاعر السلبية.",
      "weakness": "تذكر أن 90% من تصرفات الآخرين تعكس مشاكلهم هم. قبل أن تزعل، اسأل نفسك: هل هناك تفسير آخر غير شخصنة الموقف؟"
    },
    "e43": {
      "strength": "وعيك بالفرق بين النقد البناء الذي يبني والتجريح الذي يهدم يدل على نضج فكري وعاطفي.",
      "weakness": "النقد البناء يقدم لك شيئاً محدداً يمكنك تحسينه، أما التجريح فيعمم ويهاجم شخصك. تعلم أن تأخذ المفيد وتترك الباقي."
    },
    "e44": {
      "strength": "قدرتك على تحويل النقد إلى فرصة للتعلم والتطور هي سر تميزك. أنت لا تسمع فقط، بل تطبق وتتحسن باستمرار.",
      "weakness": "حاول أن تسأل نفسك بعد كل نقد: ما الذي يمكنني أن أتعلمه من هذا؟ حتى لو كان النقد قاسياً، غالباً ما يكون هناك ذرة حقيقة يمكنك الاستفادة منها."
    },
    "e45": {
      "strength": "هدوءك وعدم انزعاجك السريع من كلام الناس يدل على ثقتك العالية بنفسك واستقرارك العاطفي.",
      "weakness": "حاول أن تتذكر أن كلام الناس غالباً ما يعكس مشاكلهم هم وليس عيباً فيك. ثق بنفسك أكثر."
    },
    "e46": {
      "strength": "عادة التفكير قبل الكلام تحميك من الكثير من الندم. هذه من أهم مهارات التواصل الفعّال.",
      "weakness": "ليس عليك الرد فوراً. الصمت القصير للتفكير علامة على الحكمة وليس التردد. قل: دعني أفكر قليلاً."
    },
    "e47": {
      "strength": "تحكمك في كلامك وقت الغضب يدل على نضجك العاطفي. أنت تدرك أن الكلمات قد تترك جراحاً لا تندمل.",
      "weakness": "قبل أن تتكلم في لحظة غضب، خذ نفساً عميقاً وعد للعشرة. تذكر أن الكلمة مثل الرصاصة، إذا خرجت لا تعود."
    },
    "e48": {
      "strength": "قدرتك على تهدئة الأجواء المشحونة وحل النزاعات هي مهارة قيادية نادرة. أنت شخص مسالم ومحب للخير.",
      "weakness": "عندما تشعر أن الموقف يتجه للتصعيد، جرب تغيير نبرة صوتك أو استخدام دعابة لطيفة لتخفيف التوتر. أحياناً كلمة بسيطة تصنع فرقاً."
    },
    "e49": {
      "strength": "حكمتك في إيقاف النقاش عندما يشتعل وتأجيله لوقت لاحق تحمي العلاقة من التدهور.",
      "weakness": "عندما تشعر أن النقاش يخرج عن السيطرة، اقترح وقت مستقطع. قل: أشعر أننا بدأنا نكرر أنفسنا، هل نأخذ استراحة 15 دقيقة ثم نكمل؟"
    },
    "e50": {
      "strength": "اعتذارك الصادق الخالي من المبررات يدل على نضجك العاطفي واحترامك للآخرين. هذا السلوك يقوي الروابط ويعمق الثقة.",
      "weakness": "الاعتذار الصادق يحتوي على ثلاثة عناصر: ذكر الخطأ المحدد، التعبير عن الندم، وعدم تقديم الأعذار. جرب هذه الصيغة في المرة القادمة."
    },
    "e51": {
      "strength": "قدرتك على مسامحة نفسك وتجاوز الأخطاء تدل على صحتك النفسية وحبك لذاتك.",
      "weakness": "تعلم أن تسامح نفسك. أنت إنسان، ومن طبيعة البشر الخطأ. عامل نفسك برفق ولطف كما تعامل صديقك."
    },
    "e52": {
      "strength": "تعاطفك الصادق مع الآخرين وقدرتك على فهم مشاعرهم تجعلك إنساناً رائعاً ومحبوباً.",
      "weakness": "التعاطف مهارة يمكن تطويرها. جرب أن تستمع للآخرين دون مقاطعة، وحاول أن تضع نفسك مكانهم. قل: يبدو أن هذا صعب عليك."
    },
    "e53": {
      "strength": "مشاركتك للآخرين أفراحهم تدل على كرم أخلاقك واتساع صدرك. الفرح عندما يشارك يتضاعف.",
      "weakness": "ابدأ اليوم بإرسال رسالة تهنئة لأحدهم بمناسبة نجاح صغير. ستشعر بالسعادة وستقوي علاقتك به."
    },
    "e54": {
      "strength": "دعمك العاطفي لشريكك هو أساس العلاقة الناجحة والمتينة. وجودك بجانبه في السراء والضراء أثمن ما يمكن أن تقدمه.",
      "weakness": "اسأل شريكك اليوم: كيف كان يومك؟ وهل هناك شيء أستطيع فعله لتخفيف همك؟ هذه الأسئلة البسيطة تبني جسوراً عميقة من الدعم."
    },
    "e55": {
      "strength": "مجرد وجودك بجانب الآخرين في الأوقات الصعبة هو أعظم دعم. أنت شخص حساس ومتفهم، وهذه هبة عظيمة.",
      "weakness": "التواجد الحقيقي يعني أن تضع هاتفك جانباً وتركز بمن أمامك. جرب أن تكون موجوداً بنسبة 100% مع من تحب اليوم."
    },
    "e56": {
      "strength": "وعيك بحاجتك للدعم وقدرتك على طلبه يدل على نضجك وتواضعك. طلب المساعدة ليس ضعفاً.",
      "weakness": "لا تتردد في طلب الدعم. اختر شخصاً تثق به، وابدأ بعبارة: أمر بوقت صعب وأحتاج من يستمع لي فقط."
    },
    "e57": {
      "strength": "وجود أصدقاء تشاركهم مشاعرك يدل على علاقاتك الصحية وثقتك بالآخرين. هذا كنز ثمين.",
      "weakness": "بناء صداقات حقيقية يحتاج وقتاً وجهداً. ابدأ بالمشاركة في أنشطة جماعية وتطوعية، وكن صادقاً في تعاملك مع الآخرين."
    },
    "e58": {
      "strength": "قدرتك على التعامل مع مشاعر الوحدة رغم وجود الناس تدل على عمقك الداخلي وتفردك.",
      "weakness": "الوحدة لا تعني العزلة. جرب الانضمام لنشاط اجتماعي، أو التطوع، أو الانضمام لدورة في مجال تحبه. الالتقاء بأناس يشاركونك الاهتمامات يبني روابط."
    },
    "e59": {
      "strength": "قدرتك على تكوين روابط عاطفية قوية تدل على عمقك العاطفي وقدرتك على العطاء والحب.",
      "weakness": "الروابط القوية تحتاج وقتاً وجهداً وصدقاً. ابدأ بالاهتمام الحقيقي بالآخرين، وكن صادقاً في مشاعرك، وامنح العلاقات وقتها."
    },
    "e60": {
      "strength": "تعاملك الصحي مع الخوف من الفقدان يدل على نضجك العاطفي. أنت تدرك أن الخوف طبيعي لكنه لا يسيطر عليك.",
      "weakness": "الخوف من الفقدان طبيعي، لكن لا تدعه يسيطر على حياتك. استمتع بوجود أحبابك اليوم، وكن ممتناً لكل لحظة معهم."
    },
    "e61": {
      "strength": "ثقتك في علاقاتك وعدم قلقك المفرط يدل على استقرارك النفسي ونضجك العاطفي.",
      "weakness": "القلق المفرط على العلاقات قد يدفع الآخرين للابتعاد. ركز على تحسين نفسك وثقتك بنفسك، فالعلاقات الصحية تحتاج لمسافة من الثقة والطمأنينة."
    },
    "e62": {
      "strength": "ثقتك في استمرارية علاقاتك تدل على استقرارك العاطفي واختيارك الصحيح للأشخاص المناسبين.",
      "weakness": "الثقة في استمرارية العلاقات تبني مع الوقت. اعمل على بناء علاقات قائمة على الاحترام والصدق والوضوح، وامنحها الوقت الكافي."
    },
    "e63": {
      "strength": "تفاؤلك وعدم توقعك للفشل في علاقاتك يدل على ثقتك بنفسك وبالآخرين.",
      "weakness": "توقع الفشل قد يكون نبوءة ذاتية التحقق. بدلاً من توقع الفشل، ركز على بناء العلاقة خطوة بخطوة، وامنحها فرصة حقيقية."
    },
    "e64": {
      "strength": "تركيزك على ذاتك وعدم مقارنة نفسك بالآخرين يدل على ثقتك العالية ورضاك عن نفسك.",
      "weakness": "قارن نفسك بنفسك القديمة فقط. كل إنسان له رحلته الخاصة. المقارنة مع الآخرين طريق مؤكد للتعاسة."
    },
    "e65": {
      "strength": "فرحتك لنجاحات الآخرين وخلوك من الغيرة يدل على صفاء نفسك ونقاء قلبك.",
      "weakness": "حول الغيرة إلى إلهام. اسأل نفسك: ماذا فعل هذا الشخص لأنجح؟ وكيف يمكنني تطبيق ذلك في حياتي؟"
    },
    "e66": {
      "strength": "فرحتك الصادقة بنجاح غيرك تدل على نقاء قلبك وصفاء نفسك. هذه الصفة تجلب لك البركة والمحبة.",
      "weakness": "الفرح لنجاح الآخرين يوسع القلب ويجلب السعادة. جرب أن تبدأ بتهنئة أحدهم على إنجازه اليوم، وستشعر بفرح داخلي لا يوصف."
    },
    "e67": {
      "strength": "قدرتك على التحكم في مشاعرك السلبية وتحويلها إلى طاقة إيجابية هي مهارة عاطفية متقدمة جداً.",
      "weakness": "المشاعر السلبية جزء من الحياة، المهم ألا تسيطر عليك. جرب تقنية إعادة الصياغة: بدل هذه كارثة، قل هذا تحدٍ سأتغلب عليه."
    },
    "e68": {
      "strength": "تحويلك للمشاعر السلبية إلى إيجابية هو سر سعادتك ونجاحك. أنت تنظر للجانب المشرق دائماً.",
      "weakness": "كل مشاعر سلبية تحمل رسالة. الغضب يقول هذا ظلم، الحزن يقول خسرت شيئاً ثميناً. افهم الرسالة ثم حول طاقتك لحل المشكلة."
    },
    "e69": {
      "strength": "امتلاكك طرق صحية للتنفيس عن مشاعرك يحميك من تراكم الضغوط. استمر في الاهتمام بنفسك.",
      "weakness": "ابحث عن منفذ صحي لمشاعرك: الرياضة، الكتابة، الرسم، أو حتى المشي في الطبيعة. أي نشاط يفرغ الطاقة السلبية ولا يؤذيك أو يؤذي غيرك."
    },
    "e70": {
      "strength": "قدرتك على الاسترخاء وتهدئة أعصابك مهارة مهمة لصحتك النفسية والجسدية. استمر في ذلك.",
      "weakness": "الاسترخاء مهارة تحتاج تدريباً. جرب تطبيقات التأمل مثل Headspace أو Calm. حتى 5 دقائق يومياً تصنع فرقاً كبيراً."
    },
    "e71": {
      "strength": "امتلاكك هوايات تساعدك على تفريغ الطاقة السلبية يدل على وعيك بأهمية الصحة النفسية.",
      "weakness": "خصص وقتاً أسبوعياً لهواية تحبها. الرسم، الرياضة، القراءة، أو أي نشاط يخرجك من روتين الحياة ويجدد طاقتك."
    },
    "e72": {
      "strength": "الرياضة جزء من روتينك اليومي، وهذا رائع. الرياضة تحسن صحتك الجسدية والنفسية وتزيد من طاقتك.",
      "weakness": "حاول إدخال الرياضة في حياتك ولو بشكل بسيط. المشي 30 دقيقة يومياً يمكن أن يحدث فرقاً كبيراً في صحتك ومزاجك."
    },
    "e73": {
      "strength": "نومك المريح يدل على صحتك النفسية والجسدية الجيدة. النوم الجيد أساس الحياة المتوازنة.",
      "weakness": "النوم الجيد أساس الصحة النفسية والجسدية. جرب تنظيم موعد نومك، وتجنب الشاشات قبل النوم بساعة، واجعل غرفة نومك مظلمة وهادئة."
    },
    "e74": {
      "strength": "استيقاظك نشيطاً ومتحمساً يدل على جودة نومك وصحتك النفسية الممتازة.",
      "weakness": "الاستيقاظ بنشاط يحتاج لنوم جيد وروتين صباحي منظم. جرب الاستيقاظ مبكراً، وشرب كوب ماء، وممارسة بعض التمارين الخفيفة."
    },
    "e75": {
      "strength": "امتلاكك روتيناً يومياً يمنحك طاقة إيجابية يدل على تنظيمك وحبك لنفسك.",
      "weakness": "ابدأ يومك بنشاط إيجابي صغير: شرب ماء، قراءة ورد، ممارسة رياضة خفيفة. بداية اليوم الإيجابية تصنع يوماً كاملاً إيجابياً."
    },
    "e76": {
      "strength": "قدرتك على الاستمتاع بالأشياء البسيطة والصغيرة هي سر السعادة الحقيقية. أنت تعيش الحياة بوعي وامتنان.",
      "weakness": "تدرب على الامتنان. خصص 5 دقائق قبل النوم لتدوين ثلاثة أشياء بسيطة كنت ممتناً لها اليوم. هذا يدرب عقلك على ملاحظة الجمال."
    },
    "e77": {
      "strength": "شعورك بالامتنان تجاه ما لديك يجعلك أكثر سعادة ورضا. الامتنان يجذب المزيد من الخير لحياتك.",
      "weakness": "ابدأ بملاحظة النعم الصغيرة حولك: كوب قهوة ساخن، شمس دافئة، ابتسامة من أحدهم. الامتنان يفتح أبواب السعادة."
    },
    "e78": {
      "strength": "نظرتك للجانب المشرق في كل موقف وتفاؤلك بالمستقبل طاقة إيجابية تنعكس على كل من حولك.",
      "weakness": "في كل موقف صعب، اسأل نفسك: ما الفرصة المخبأة هنا؟ وما الذي يمكنني تعلمه من هذا؟ التفاؤل عادة تكتسب بالممارسة."
    },
    "e79": {
      "strength": "تفاؤلك بالمستقبل يمنحك قوة دافعة للاستمرار رغم الصعوبات. المتفائلون هم من يغيرون العالم.",
      "weakness": "التفاؤل لا يعني تجاهل الصعوبات، بل يعني الثقة في قدرتك على تجاوزها. اقرأ قصص أناس تغلبوا على تحديات كبيرة."
    },
    "e80": {
      "strength": "تعاملك الصحي مع الخوف من المستقبل يدل على نضجك. أنت تخطط للمستقبل دون أن يسيطر عليك القلق.",
      "weakness": "الخوف من المستقبل طبيعي، لكن لا تدعه يشلك. خطط لمستقبلك خطوة بخطوة، وركز على ما يمكنك التحكم فيه اليوم."
    },
    "e81": {
      "strength": "وضوح خطتك لحياتك العاطفية يدل على نضجك ووعيك بما تريد في العلاقات.",
      "weakness": "خذ وقتاً للتفكير فيما تريده حقاً في حياتك العاطفية. ما هي قيمك؟ ما هي احتياجاتك؟ ما هي حدودك؟ الوضوح مع النفس يسهل الوصول لما تريد."
    },
    "e82": {
      "strength": "معرفتك باحتياجاتك العاطفية بدقة هي خطوة مهمة نحو علاقات صحية وناجحة. أنت تعرف ما تريد.",
      "weakness": "خصّص وقتاً للتأمل في احتياجاتك: هل تحتاج حباً؟ تقديراً؟ أمناً؟ استقراراً؟ معرفة احتياجاتك هي أول خطوة لتلبيتها."
    },
    "e83": {
      "strength": "قدرتك على إيصال احتياجاتك العاطفية لشريكك بوضوح هي مفتاح التفاهم والانسجام بينكما. تواصلك رائع.",
      "weakness": "استخدم أسلوب أنا أحتاج بدلاً من أنت لا تعطيني. مثلاً: أنا أحتاج أن أشعر بالتقدير بدلاً من أنت لا تقدرني."
    },
    "e84": {
      "strength": "وعيك بعدم توقع قراءة الأفكار من شريكك يدل على نضجك. التواصل الواضح أساس العلاقات الصحية.",
      "weakness": "لا تتوقع من أحد أن يفهمك دون كلام. عبر عن احتياجك بوضوح. الناس لا يقرأون الأفكار."
    },
    "e85": {
      "strength": "تعاملك الهادئ مع عدم فهم شريكك لك يدل على نضجك. أنت تدرك أن سوء الفهم وارد في أي علاقة.",
      "weakness": "بدلاً من الانزعاج، حاول أن توضح ما تريد بطريقة مختلفة. اسأل شريكك: هل تريد مني أن أشرح بشكل آخر؟"
    },
    "e86": {
      "strength": "فهمك العميق لاحتياجات شريكك وقدرتك على تلبيتها يدل على حبك الحقيقي واهتمامك به.",
      "weakness": "اسأل شريكك مباشرة: ما الذي يجعلك تشعر بالحب؟ وما أكثر شيء تحتاجه مني الآن؟ لا تفترض أنك تعرف، اسأل وتأكد."
    },
    "e87": {
      "strength": "سؤالك الدائم لشريكك عن احتياجاته يدل على حرصك على راحته وسعادته. هذا هو الحب الحقيقي.",
      "weakness": "اجعل السؤال عن احتياجات شريكك عادة يومية. كيف كان يومك؟، هل هناك شيء تريد التحدث عنه؟، كيف يمكنني مساعدتك اليوم؟"
    },
    "e88": {
      "strength": "مرونتك في التكيف مع احتياجات شريكك تدل على حبك وتفهمك. هذه من أهم صفات الشريك الناجح.",
      "weakness": "العلاقات الناجحة تقوم على التكيف المتبادل. حاول أن تتفهم احتياجات شريكك وتلبيها بقدر استطاعتك، مع الحفاظ على حدودك."
    },
    "e89": {
      "strength": "مرونتك في التعامل مع اختلافات الآخرين تدل على نضجك واتساع أفقك.",
      "weakness": "تذكر أن الاختلافات ليست تهديداً، بل هي فرصة للتعلم والنمو. كل شخص يضيف لنا منظوراً جديداً للحياة."
    },
    "e90": {
      "strength": "تقبلك لاختلافات الناس وعدم محاولة تغييرهم يدل على حكمتك وفهمك العميق للطبيعة البشرية.",
      "weakness": "لا أحد كامل، ولا أحد سيكون كما تريد تماماً. تقبل عيوب الآخرين كما تريدهم أن يتقبلوا عيوبك. هذا هو مفتاح العلاقات الناجحة."
    },
    "e91": {
      "strength": "وعيك بأن تغيير الآخرين ليس من مهامك يدل على نضجك. أنت تركز على نفسك وتقبل الآخرين كما هم.",
      "weakness": "لا يمكنك تغيير أحد، يمكنك فقط أن تكون قدوة حسنة. ركز على تطوير نفسك بدلاً من محاولة تغيير الآخرين."
    },
    "e92": {
      "strength": "قدرتك على التعامل مع مختلف الشخصيات تدل على مرونتك وذكائك الاجتماعي العالي.",
      "weakness": "تعلم فن التعامل مع الاختلافات. احترم وجهات النظر المختلفة، وركز على نقاط الاتفاق، وتجنب الأحكام المطلقة."
    },
    "e93": {
      "strength": "قدرتك على بناء علاقات صحية متوازنة مبنية على الاحترام والثقة هي مهارة حياتية رائعة.",
      "weakness": "العلاقات الصحية تحتاج لوقت وجهد. ابدأ بوضع أسس واضحة: الاحترام، الثقة، الصدق، والتواصل المفتوح. ولا تتعجل في العلاقات."
    },
    "e94": {
      "strength": "حرصك على الحفاظ على علاقاتك وتطويرها يدل على وفائك وإخلاصك. العلاقات الناجحة تحتاج من يحافظ عليها.",
      "weakness": "العلاقات كالنباتات، تحتاج رعاية مستمرة. خصص وقتاً دورياً للأشخاص المهمين في حياتك، وكن حاضراً معهم بقلبك قبل جسدك."
    },
    "e95": {
      "strength": "وعيك بعدم استنزاف نفسك في العلاقات يدل على حبك لذاتك وقدرتك على وضع حدود صحية.",
      "weakness": "الاستنزاف العاطفي علامة على علاقة غير متوازنة. تعلم أن تقول لا، وضع حدوداً صحية، وامنح نفسك وقتاً للراحة وإعادة الشحن."
    },
    "e96": {
      "strength": "وعيك بأهمية وضع حدود صحية في العلاقات يحميك من الاستنزاف ويحافظ على احترامك لذاتك.",
      "weakness": "تعلم أن تقول لا بلطف. الحدود الصحية تحمي طاقتك وتحافظ على احترامك لذاتك. لا أستطيع مساعدتك الآن جملة بسيطة ومحترمة."
    },
    "e97": {
      "strength": "قدرتك على حماية نفسك عاطفياً وعدم السماح للآخرين باستنزافك تدل على نضجك وحبك لذاتك.",
      "weakness": "الحماية العاطفية لا تعني بناء جدران عالية، بل تعني اختيار من تمنحه قلبك بعناية. لا تعطِ حبك لكل من يسأل، اختر بعناية."
    },
    "e98": {
      "strength": "وعيك بمشاعرك في اللحظة التي تحدث فيها هو قمة الذكاء العاطفي. أنت تعيش مشاعرك بوعي كامل.",
      "weakness": "تدرب على اللحظة الحاضرة. عندما تشعر بمشاعر قوية، توقف للحظة واسأل نفسك: ماذا أشعر الآن؟ وأين هذا الشعور في جسدي؟"
    },
    "e99": {
      "strength": "قدرتك على تسمية مشاعرك بدقة تدل على وعي عاطفي متقدم. استمر في تطوير هذه المهارة.",
      "weakness": "تعلم مفردات عاطفية جديدة. بدلاً من أنا تعبان، قل أنا محبط أو أنا حزين أو أنا قلق. التحديد الدقيق يساعد في التعامل مع المشاعر."
    },
    "e100": {
      "strength": "قدرتك على تفكيك المشاعر المتداخلة وتمييز كل شعور على حدة مهارة عاطفية متقدمة جداً.",
      "weakness": "عندما تشعر بمشاعر متداخلة، خذ ورقة واكتب كل شعور على حدة. هذا التفكيك يساعدك على فهم ما يحدث بداخلك."
    },
    "r1": {
      "strength": "التزامك بواجباتك حتى في الأيام الصعبة يدل على قوة شخصيتك وانضباطك الذاتي العالي. أنت شخص يُحتذى به.",
      "weakness": "قسّم المهام الكبيرة إلى مهام صغيرة جداً. ابدأ بمهمة واحدة فقط اليوم والتزم بها. النجاح في مهمة صغيرة يحفزك على الالتزام بمهام أكبر."
    },
    "r2": {
      "strength": "إدارتك الرائعة للوقت وتنظيمك لمهامك سر من أسرار نجاحك وإنتاجيتك العالية. استمر في تطوير هذه المهارة.",
      "weakness": "جرب تقنية تحديد الوقت: حدد موعداً محدداً لكل مهمة في يومك، تماماً مثل مواعيدك الرسمية. التزم بهذا الجدول لمدة أسبوع ولاحظ الفرق."
    },
    "r3": {
      "strength": "تحملك لنتائج قراراتك بكل شجاعة، سواء كانت جيدة أو سيئة، هو قمة المسؤولية والنضج الشخصي.",
      "weakness": "قبل اتخاذ أي قرار، اسأل نفسك: ما هي أفضل نتيجة محتملة؟ ما هي أسوأ نتيجة؟ وهل أستطيع تحمل الأسوأ؟ هذا يجعلك أكثر استعداداً."
    },
    "r4": {
      "strength": "قدرتك على الموازنة بين جوانب حياتك المختلفة تحميك من الإرهاق وتحقق لك السعادة.",
      "weakness": "ضع حدوداً واضحة بين العمل والمنزل. مثلاً: لا تفحص البريد الإلكتروني للعمل بعد الثامنة مساءً. خصص وقتاً للعائلة كموعد مقدس."
    },
    "r5": {
      "strength": "صمودك وقدرتك على تحمل ضغوط الحياة دون انهيار يدل على قوة شخصيتك وصلابتك النفسية.",
      "weakness": "الضغط ليس عدوك دائماً. تعلم أن تفرق بين الضغط الإيجابي الذي يحفزك والضغط السلبي الذي يرهقك. واجه مصادر الضغط السلبي."
    },
    "r6": {
      "strength": "وفاؤك بوعودك هو أثمن ما تملك. الناس تثق فيك وتحترمك لأن كلمتك هي ميزانك. حافظ على هذه الثقة الغالية.",
      "weakness": "لا تعد بشيء لا تستطيع فعله. وإذا وعدت، فاحرص على التنفيذ. قبل أن تعد، فكر جيداً: هل أنا متأكد من قدرتي على الوفاء بهذا؟"
    },
    "r7": {
      "strength": "وعيك بأهمية أن تكون قدوة حسنة لمن حولك يدل على نضجك وإحساسك العالي بالمسؤولية المجتمعية.",
      "weakness": "القدوة تبدأ بالأفعال الصغيرة اليومية. كن صادقاً، ملتزماً، محترماً في تعاملاتك اليومية، وستجد تأثيرك يتسع دون أن تشعر."
    },
    "r8": {
      "strength": "استعدادك النفسي والعملي لتحمل مسؤولية أسرة يدل على نضجك وجديتك واستعدادك لبناء مستقبل.",
      "weakness": "ابدأ بتحمل مسؤوليات صغيرة بشكل ثابت. ساعد في إدارة ميزانية المنزل، تحمل مسؤولية قرار عائلي. هذا يعدك تدريجياً."
    },
    "r9": {
      "strength": "التزامك بالمواعيد النهائية وإنجاز أعمالك في وقتها يدل على احترافيتك وانضباطك.",
      "weakness": "حدد مواعيد نهائية قبل الموعد الحقيقي بيوم. هذا يعطيك مساحة للطوارئ. واستخدم المنبهات للتذكير."
    },
    "r10": {
      "strength": "إخلاصك في العمل حتى بدون رقيب صفة الأبطال. أنت تعمل كأن الله يراك، وهذه أعلى درجات الإخلاص.",
      "weakness": "الإخلاص في العمل حتى لو لم يراك أحد هو ما يميز الناجحين. اعمل كأن الله يراك."
    },
    "r11": {
      "strength": "كونك شخصاً يُعتمد عليه ويلجأ له الآخرون في الصعاب هو أعظم شهادة يمكن أن تحصل عليها في حياتك.",
      "weakness": "لكي تكون شخصاً يُعتمد عليه، ابدأ بالالتزام بالمواعيد الصغيرة. كن دقيقاً، نفذ ما تعد به، حتى في أبسط الأمور."
    },
    "r12": {
      "strength": "دقتك في المواعيد والتزامك بتسليم المهام في وقتها يدل على احترافيتك وانضباطك.",
      "weakness": "قسّم المهام الكبيرة إلى أجزاء صغيرة، وضع موعداً نهائياً لكل جزء. هذا يسهل عليك إنجاز المهمة كاملة في وقتها."
    },
    "r13": {
      "strength": "اعتمادك على نفسك وعدم احتياجك لمن يذكرك بواجباتك يدل على مسؤوليتك العالية.",
      "weakness": "استخدم التطبيقات والتذكيرات. دوّن كل الواجبات والمواعيد فوراً. لا تعتمد على ذاكرتك وحدها."
    },
    "r14": {
      "strength": "تخطيطك ليومك قبل أن يبدأ يزيد إنتاجيتك ويوفر وقتك وجهدك. هذه عادة الناجحين والمبدعين.",
      "weakness": "خصّص 10 دقائق كل مساء للتخطيط لليوم التالي. اكتب أهم 3 مهام يجب إنجازها. هذا التمرين سيوفر لك وقتاً وجهداً كبيرين."
    },
    "r15": {
      "strength": "امتلاكك أهدافاً واضحة ومحددة في الحياة يمنحك اتجاهاً وبوصلة تسير عليها. استمر في السعي.",
      "weakness": "اكتب أهدافك. الأهداف المكتوبة تزيد فرص تحقيقها بشكل كبير. استخدم طريقة SMART: محددة، قابلة للقياس، قابلة للتحقيق، منطقية، ومحددة بزمن."
    },
    "r16": {
      "strength": "سعيك الدؤوب لتحقيق أهدافك وعدم التوقف حتى تصل إليها يدل على طموحك وإصرارك.",
      "weakness": "قسّم هدفك الكبير إلى أهداف أسبوعية صغيرة جداً. ركز فقط على الهدف الصغير لهذا الأسبوع. الإنجازات الصغيرة تبني زخماً."
    },
    "r17": {
      "strength": "إصرارك وعدم استسلامك أمام الصعوبات يدل على عزيمتك القوية وإيمانك بنفسك.",
      "weakness": "قبل أن تستسلم، جرب مرة أخيرة. ومرة أخرى. الاستسلام سهل، لكن الشعور بعد التحدي والإنجاز أجمل بكثير."
    },
    "r18": {
      "strength": "إصرارك واستمرارك في طريقك رغم التحديات يدل على عزيمتك القوية وإيمانك بنفسك.",
      "weakness": "الاستمرارية أهم من السرعة. سلحفاة تصل أفضل من أرنب ينام. اثبت على وتيرتك، حتى لو كانت بطيئة، المهم ألا تتوقف."
    },
    "r19": {
      "strength": "مرونتك في تغيير خططك عند مواجهة عقبات تدل على ذكائك وقدرتك على التكيف مع المتغيرات.",
      "weakness": "المرونة مطلوبة، لكن تأكد أنك تغير الخطة وليس الهدف. اكتب هدفك الأساسي ودون تحته خطة أ وخطة ب وخطة ج."
    },
    "r20": {
      "strength": "امتلاكك خططاً بديلة يدل على بعد نظرك واستعدادك للطوارئ. هذه من صفات القادة الناجحين.",
      "weakness": "دائماً ضع خطة باء. الحياة لا تسير كما نخطط دائماً، والجاهزية تقلل الصدمات. خطط للأسوأ واعمل للأفضل."
    },
    "r21": {
      "strength": "قدرتك على تقييم نفسك بموضوعية وصدق تدل على وعيك الذاتي العالي ورغبتك في التطور.",
      "weakness": "اسأل شخصاً تثق به عن رأيه في أدائك. أحياناً الآخرون يرون نقاط قوتنا وضعفنا بشكل أوضح مما نراه نحن."
    },
    "r22": {
      "strength": "تقبلك لخطئك واعترافك به يدل على نضجك وتواضعك. هذه من أعظم صفات المتعلمين.",
      "weakness": "من لا يخطئ لا يتعلم. تقبل أن الخطأ جزء من رحلة التعلم، المهم أن تتعلم منه ولا تكرره."
    },
    "r23": {
      "strength": "سرعة مبادرتك بتصحيح أخطائك وعدم تكرارها يدل على وعيك ورغبتك الصادقة في التحسن.",
      "weakness": "تصحيح الخطأ فوراً يوفر عليك الكثير مستقبلاً. لا تؤجل التصحيح. كلما أسرعت في إصلاح الخطأ، كان الضرر أقل."
    },
    "r24": {
      "strength": "تعاملك مع الأخطاء وتجنبك لتكرارها يدل على نضجك وقدرتك على التعلم من تجاربك.",
      "weakness": "توقف وحلل: لماذا أكرر هذا الخطأ؟ ما المشاعر أو الأفكار التي تسبق هذا السلوك؟ أحياناً يكون تكرار الخطأ مؤشراً على حاجة نفسية أعمق."
    },
    "r25": {
      "strength": "قدرتك على استخلاص الدروس والعبر من تجاربك الحياتية هي سر حكمتك ونضجك المبكر.",
      "weakness": "خصّص وقتاً أسبوعياً لمراجعة أسبوعك. اسأل نفسك: ما الذي تعلمته هذا الأسبوع؟ ما التحديات التي واجهتها وكيف تغلبت عليها؟"
    },
    "r26": {
      "strength": "سعيك الدائم لتطوير نفسك وتعلم الجديد هو مفتاح نجاحك وتقدمك في الحياة. استمر في هذا الطريق.",
      "weakness": "خصّص 30 دقيقة يومياً للتعلم. استمع لبودكاست، اقرأ كتاباً، شاهد فيديو تعليمياً. الاستمرارية أهم من الكم."
    },
    "r27": {
      "strength": "شغفك بتعلم مهارات جديدة واكتساب معرفة في مجالات مختلفة يدل على فضولك الفكري وحبك للتطور.",
      "weakness": "اختر مهارة واحدة مفيدة في حياتك أو عملك. خصّص 20 دقيقة يومياً لتعلمها. بعد 30 يوماً، ستكون قد قطعت شوطاً كبيراً."
    },
    "r28": {
      "strength": "فضولك المعرفي وشغفك بالاستكشاف والتعلم يجعلك شخصاً مثقفاً ومتجداً دائماً.",
      "weakness": "اسأل دائماً لماذا؟ وكيف؟ لا تقبل المعلومات كما هي دون تفكير. الفضول هو مفتاح التعلم والاكتشاف."
    },
    "r29": {
      "strength": "استغلالك الجيد لوقت فراغك في أشياء مفيدة يدل على وعيك بأهمية الوقت وحبك للتطور.",
      "weakness": "حدد هوايات أو مهارات تريد تعلمها. خصّص وقت فراغك لتطوير نفسك فيها. الفراغ نعمة، استغله بحكمة."
    },
    "r30": {
      "strength": "وعيك بأهمية الوقت وعدم إضاعته في أمور غير مفيدة يدل على نضجك ومسؤوليتك.",
      "weakness": "الوقت هو الحياة. حدد 3 أشياء مهمة يومياً وركز عليها. ابتعد عن مشتتات الوقت مثل وسائل التواصل الاجتماعي."
    },
    "r31": {
      "strength": "قدرتك على تحديد أولوياتك والتركيز على المهم أولاً تجعلك أكثر إنتاجية ونجاحاً في حياتك.",
      "weakness": "استخدم مصفوفة أيزنهاور: قسم مهامك إلى مهم وعاجل افعله فوراً، مهم غير عاجل خطط له، غير مهم عاجل فوّضه، غير مهم غير عاجل احذفه."
    },
    "r32": {
      "strength": "قدرتك على رفض ما لا يناسب أولوياتك والتركيز على المهم يدل على حزمك وحكمتك.",
      "weakness": "تعلم أن تقول لا للأمور التي تشتتك عن أهدافك. كل نعم لشيء هي لا لشيء آخر. اختر بعناية."
    },
    "r33": {
      "strength": "تركيزك على ما هو مهم وعدم تشتيت نفسك بأمور ثانوية هو سر إنجازاتك الكبيرة.",
      "weakness": "كل صباح، حدد أهم 3 مهام يجب إنجازها اليوم. ابدأ بالأصعب أولاً أكل الضفدع، ثم انتقل للأسهل."
    },
    "r34": {
      "strength": "قدرتك على التركيز وعدم التشتت تدل على انضباطك الذاتي ووضوح أولوياتك.",
      "weakness": "أنهي مهمة واحدة فقط في كل مرة. أغلق الإشعارات، ضع الهاتف في غرفة أخرى، وركز على ما تفعله الآن. التشتت بين المهام يقلل الإنتاجية."
    },
    "r35": {
      "strength": "حرصك على مراجعة أعمالك والتأكد من دقتها يدل على احترافيتك واهتمامك بالجودة.",
      "weakness": "خصص وقتاً لمراجعة أعمالك قبل تسليمها. المراجعة تكشف الأخطاء وتضمن الجودة العالية."
    },
    "r36": {
      "strength": "مراجعتك لقراراتك قبل تنفيذها تدل على حكمتك وبعد نظرك.",
      "weakness": "قبل تنفيذ أي قرار مهم، خذ وقتاً للتفكير. اسأل نفسك: ما البدائل؟ ما العواقب المحتملة؟ استشر أهل الخبرة."
    },
    "r37": {
      "strength": "استشارتك لأهل الخبرة تدل على تواضعك وحكمتك. أنت تدرك أنك لا تعرف كل شيء.",
      "weakness": "لا تتردد في سؤال أهل الخبرة. استشارة المختصين توفر عليك وقتاً وجهداً وأخطاء كثيرة."
    },
    "r38": {
      "strength": "أخذك الوقت الكافي للتفكير قبل القرارات يدل على رزانتك وحكمتك.",
      "weakness": "لا تتعجل في القرارات المصيرية. خذ وقتك للتفكير، وادرس جميع الخيارات، واستشر من تثق بهم."
    },
    "r39": {
      "strength": "اتزانك وعدم تسرعك في القرارات يدل على حكمتك ونضجك.",
      "weakness": "قبل اتخاذ أي قرار مهم، خذ نفساً عميقاً. اسأل نفسك: هل أنا متسرع؟ هل فكرت في كل الاحتمالات؟"
    },
    "r40": {
      "strength": "قلة ندمك على قراراتك يدل على حكمتك وثقتك في اختياراتك.",
      "weakness": "الندم شعور طبيعي، لكن لا تدعه يشلك. تعلم من قراراتك الخاطئة، واستفد منها في المستقبل."
    },
    "r41": {
      "strength": "تحملك لتبعات قراراتك وعدم هروبك من المسؤولية يدل على نضجك وأخلاقك العالية.",
      "weakness": "لا تتهرب من تبعات قراراتك. مواجهة النتائج بشجاعة تجعلك أكثر حكمة في المرة القادمة. كل خطأ تتحمله هو درس تتعلمه."
    },
    "r42": {
      "strength": "قدرتك على تحمل المسؤولية وعدم الهروب منها تدل على نضجك وشخصيتك القوية.",
      "weakness": "اسأل نفسك بصدق: ما هو الخوف الذي يختبئ خلف هروبي من هذه المسؤولية؟ مواجهة الخوف الداخلي هي الخطوة الأولى لتجاوز الهروب."
    },
    "r43": {
      "strength": "صدقك مع نفسك ومع الآخرين وعدم اختلاق الأعذار يدل على نزاهتك وأخلاقك.",
      "weakness": "توقف عن اختلاق الأعذار. كن صادقاً مع نفسك ومع الآخرين. الاعتراف بالتقصير أفضل من اختلاق الأكاذيب."
    },
    "r44": {
      "strength": "تحملك للمسؤولية وعدم لومك للظروف يدل على نضجك وقوة شخصيتك.",
      "weakness": "الظروف جزء من اللعبة، لكنها ليست كل شيء. ركز على ما يمكنك التحكم فيه بدلاً من لوم ما لا يمكنك تغييره."
    },
    "r45": {
      "strength": "وعيك بدورك في مشاكلك وعدم إلقاء اللوم على الآخرين يدل على نضجك العاطفي.",
      "weakness": "اسأل نفسك بصدق: ما هو دوري في هذه المشكلة؟ تحمل المسؤولية هو الخطوة الأولى للحل."
    },
    "r46": {
      "strength": "قدرتك على إنجاز مهام متعددة بكفاءة تدل على مهاراتك التنظيمية العالية.",
      "weakness": "أنهي مهمة واحدة في كل مرة. التركيز على مهمة واحدة يزيد الإنتاجية ويقلل الأخطاء."
    },
    "r47": {
      "strength": "تنظيمك الجيد للوقت بين المهام المختلفة يدل على مهاراتك التخطيطية العالية.",
      "weakness": "استخدم تقنية بومودورو: 25 دقيقة عمل مركز، 5 دقائق راحة. كرر. هذا يساعدك على تنظيم وقتك بين المهام."
    },
    "r48": {
      "strength": "قدرتك على التوفيق بين العمل والمنزل بمهارة تدل على قدرتك التنظيمية العالية وحرصك على الجميع.",
      "weakness": "ناقش مع أسرتك التحديات التي تواجهك في التوفيق بين العمل والمنزل. أحياناً مجرد المشاركة والتفاهم يخفف الضغط ويولد حلولاً مبتكرة."
    },
    "r49": {
      "strength": "توازنك بين حياتك الاجتماعية والعملية يدل على نضجك وقدرتك على إدارة وقتك بكفاءة.",
      "weakness": "حدد أولوياتك بوضوح. خصص وقتاً للعمل وآخر للراحة وآخر للتواصل الاجتماعي. التوازن هو المفتاح."
    },
    "r50": {
      "strength": "اهتمامك بنفسك وتخصيص وقت لك يدل على وعيك بأهمية الصحة النفسية والتوازن.",
      "weakness": "خصص وقتاً لنفسك يومياً، حتى لو كان قصيراً. وقت الراحة والاسترخاء ضروري لتجديد طاقتك."
    },
    "r51": {
      "strength": "قدرتك على أخذ قسط من الراحة دون شعور بالذنب تدل على صحتك النفسية وتوازنك.",
      "weakness": "الراحة حقك وليست رفاهية. جسمك وعقلك يحتاجان للراحة لتجديد الطاقة. خذ راحتك دون guilt."
    },
    "r52": {
      "strength": "قدرتك على الحفاظ على صحتك رغم ضغوط العمل تدل على قوتك وحكمتك.",
      "weakness": "إذا كان عملك يؤثر على صحتك، فقد حان الوقت لإعادة النظر في أولوياتك. الصحة لا تقدر بثمن. حاول تنظيم وقتك بشكل أفضل، وخصص وقتاً للراحة."
    },
    "r53": {
      "strength": "قدرتك على التعامل مع ضغوط العمل بهدوء واحترافية تجعلك زميلاً مثالياً وقائداً محتملاً.",
      "weakness": "جرب تقنية الاستراحة الذهنية: كل ساعة عمل، خذ 5 دقائق ابتعد فيها عن مكتبك، تنفس بعمق، أو تمش قليلاً. هذا يعيد شحن طاقتك."
    },
    "r54": {
      "strength": "قدرتك على الفصل بين العمل والمنزل تدل على توازنك وحكمتك.",
      "weakness": "ضع حدوداً واضحة بين العمل والمنزل. عندما تغادر مكان العمل، اتركه خلفك. خصص وقتاً للعائلة والراحة."
    },
    "r55": {
      "strength": "قدرتك على ترك العمل خلفك والاستمتاع بوقتك في المنزل تدل على توازنك الصحي.",
      "weakness": "التفكير المستمر في العمل يمنعك من الاستمتاع بحياتك الشخصية. جرب تمارين اليقظة الذهنية لتساعدك على البقاء في الحاضر."
    },
    "r56": {
      "strength": "قدرتك على الفصل بين حياتك المهنية والشخصية تدل على نضجك وتوازنك.",
      "weakness": "ضع حدوداً واضحة بين العمل والحياة الشخصية. عندما تكون في المنزل، انشغل بالعائلة والهوايات، واترك العمل لمكانه وزمانه."
    },
    "r57": {
      "strength": "قدرتك على تكوين عادات إيجابية والحفاظ عليها تدل على انضباطك الذاتي العالي.",
      "weakness": "استخدم قاعدة الربط: اربط العادة الجديدة بعادة موجودة. مثلاً: بعد شرب القهوة الصباحية، اقرأ 5 دقائق. هذا يساعد على التثبيت."
    },
    "r58": {
      "strength": "استمراريتك على العادات الإيجابية تدل على قوة إرادتك وانضباطك.",
      "weakness": "الاستمرارية تحتاج لصبر. لا تيأس إذا فشلت في يوم، عُد في اليوم التالي. المهم ألا تتوقف."
    },
    "r59": {
      "strength": "قدرتك على التوقف عن العادات السلبية تدل على قوة إرادتك ووعيك الذاتي.",
      "weakness": "لا تحاول ترك العادة السيئة فجأة، بل استبدلها بعادة إيجابية. بدل تصفح الجوال، اقرأ كتاباً. بدل المشروبات الغازية، اشرب ماء."
    },
    "r60": {
      "strength": "قوة إرادتك هي سر نجاحك وتفوقك. حافظ عليها واستخدمها في تحقيق أهدافك.",
      "weakness": "قوة الإرادة مثل البطارية، تفرغ مع الاستخدام. ركز على تغيير عادة واحدة فقط في كل مرة، ولا تشتت إرادتك على عدة جبهات."
    },
    "r61": {
      "strength": "قدرتك على مقاومة الإغراءات تدل على قوة إرادتك ووضوح أهدافك.",
      "weakness": "ابتعد عن مصادر الإغراء. إذا كان الإغراء هو الجوال، أبعده عن متناول يدك. إذا كان الأكل غير الصحي، لا تشتريه أصلاً."
    },
    "r62": {
      "strength": "قدرتك على مقاومة الإغراءات وعدم الاستسلام لها تدل على قوة شخصيتك.",
      "weakness": "قبل أن تستسلم، ذكر نفسك بأهدافك الكبيرة. اسأل نفسك: هل هذا الإغراء يستحق التضحية بأهدافي؟"
    },
    "r63": {
      "strength": "انضباطك الذاتي هو مفتاح نجاحك وتفوقك في الحياة. حافظ على هذه الصفة الرائعة.",
      "weakness": "الانضباط كالعضلة، يحتاج تدريباً يومياً. ابدأ بالتزامات صغيرة جداً: استيقظ مبكراً 10 دقائق، امشِ 15 دقيقة يومياً. كرر لمدة 30 يوماً."
    },
    "r64": {
      "strength": "التزامك بروتين صحي يدل على حبك لذاتك واهتمامك بصحتك. استمر في هذا.",
      "weakness": "ابدأ بروتين صحي بسيط: اشرب كوب ماء عند الاستيقاظ، امشِ 20 دقيقة يومياً، نم 7 ساعات. البساطة تساعد على الاستمرار."
    },
    "r65": {
      "strength": "اهتمامك بنظامك الغذائي وصحتك يدل على وعيك وحبك لذاتك.",
      "weakness": "صحتك هي أغلى ما تملك. ابدأ بفحص طبي دوري، واهتم بنومك وغذائك. الصحة الجيدة تزيد إنتاجيتك وسعادتك."
    },
    "r66": {
      "strength": "اهتمامك بنفسك ورعايتك لذاتك يدل على حبك وتقديرك لنفسك.",
      "weakness": "الاعتناء بالنفس ليس أنانية. خصص وقتاً لنفسك أسبوعياً، افعل ما تحب، استرخِ، اقرأ. هذا يعيد شحن طاقتك."
    },
    "r67": {
      "strength": "قدرتك على تحمل مسؤولية الآخرين تدل على نضجك وإحساسك العالي بالمسؤولية.",
      "weakness": "ابدأ بمسؤوليات صغيرة: ساعد أحدهم في مهمة بسيطة، تطوع لرعاية قريب. كل تجربة ناجحة تبني ثقتك."
    },
    "r68": {
      "strength": "رعايتك لحيوان أو نبات تدل على حساسيتك ومسؤوليتك وحبك للعناية بالآخرين.",
      "weakness": "جرب رعاية نبات صغير. الاعتناء بكائن حي يعلمك الصبر والمسؤولية والحنان."
    },
    "r69": {
      "strength": "اهتمامك بمن يحتاج إليك يدل على إنسانيتك العالية وطيبة قلبك.",
      "weakness": "الاهتمام بالآخرين يبدأ بملاحظتهم. اسأل عن أحوالهم، قدم مساعدة بسيطة، كن موجوداً. هذه الأفعال الصغيرة تبني علاقات عميقة."
    },
    "r70": {
      "strength": "قدرتك على اتخاذ قرارات نيابة عن الآخرين عند الضرورة تدل على ثقتهم بك وحكمتك.",
      "weakness": "عند اتخاذ قرار نيابة عن آخر، ضع مصلحته أولاً. استشر إن أمكن، وفكر في جميع الخيارات بعناية."
    },
    "r71": {
      "strength": "تعاملك الصحي مع الخوف من مسؤولية العائلة يدل على نضجك. الخوف طبيعي لكنه لا يمنعك.",
      "weakness": "الخوف طبيعي، لكن لا تدعه يشلك. ابدأ بالمشاركة في مسؤوليات أسرتك الحالية، وتحدث مع آباء ناجحين عن تجاربهم."
    },
    "r72": {
      "strength": "استعدادك النفسي للزواج يدل على نضجك العاطفي واستعدادك لبناء حياة مشتركة.",
      "weakness": "الاستعداد للزواج ليس مجرد استعداد مادي، هو استعداد نفسي وعاطفي. اقرأ عن الحياة الزوجية، تحدث مع متزوجين ناجحين، ونمّ وعيك بهذا المجال."
    },
    "r73": {
      "strength": "استعدادك المادي للزواج يدل على مسؤوليتك وتخطيطك الجيد للمستقبل.",
      "weakness": "الاستعداد المادي مهم، لكنه ليس كل شيء. خطط لمستقبلك المالي، وادخر بانتظام، وناقش الأمور المالية مع شريكك المستقبلي بشفافية."
    },
    "r74": {
      "strength": "وجود خطة للزواج يدل على جديتك وتفكيرك المنظم في مستقبلك.",
      "weakness": "الزواج قرار مصيري، لا تتركه للصدف. ابدأ بالتفكير بجدية في مواصفات شريك حياتك، واستعد نفسياً ومادياً."
    },
    "r75": {
      "strength": "تفكيرك في تفاصيل الحياة الزوجية يدل على وعيك واستعدادك للحياة الواقعية.",
      "weakness": "تحدث مع متزوجين ناجحين، اقرأ كتباً عن الحياة الزوجية. المعرفة المسبقة توفر عليك الكثير من المشاكل مستقبلاً."
    },
    "r76": {
      "strength": "قدرتك على تحمل مسؤولية القرارات المشتركة تدل على نضجك وروحك التعاونية.",
      "weakness": "القرارات المشتركة تحتاج حواراً وليس صراعاً. تدرب على الاستماع والتفاوض مع أفراد عائلتك في القرارات اليومية الصغيرة."
    },
    "r77": {
      "strength": "قدرتك على التفاوض والوصول إلى حلول ترضي الجميع تدل على ذكائك الاجتماعي وحكمتك.",
      "weakness": "التفاوض ليس حرباً. ابحث عن حل يحقق مكسباً للجميع. تدرب على التفاوض في مواقف بسيطة مثل اختيار مطعم أو برنامج تلفزيوني."
    },
    "r78": {
      "strength": "قدرتك على إيجاد حلول ترضي الجميع تدل على ذكائك الاجتماعي وحكمتك.",
      "weakness": "ابحث عن الحلول الإبداعية. اسأل: ما هو الحل الذي يحقق لك بعضاً مما تريد ويحقق لي بعضاً مما أريد؟ فكر خارج الصندوق."
    },
    "r79": {
      "strength": "مرونتك في التعامل مع الظروف المختلفة تدل على قدرتك على التكيف وحكمتك.",
      "weakness": "المرونة مهارة. ابدأ بتغيير روتينك اليومي بين الحين والآخر. جرب طرقاً جديدة في عملك وحياتك."
    },
    "r80": {
      "strength": "قدرتك على التأقلم مع التغييرات تدل على مرونتك وقوتك الداخلية.",
      "weakness": "التغيير سنة الحياة. بدلاً من مقاومته، حاول أن تبحث عن فرص فيه. كل تغيير يحمل معه فرصاً جديدة."
    },
    "r81": {
      "strength": "تعاملك الصحي مع الخوف من التغيير يدل على نضجك. الخوف طبيعي لكنه لا يسيطر عليك.",
      "weakness": "ابدأ بتغييرات صغيرة غير مخيفة. جرب طعاماً جديداً، طريقاً جديداً للعمل. كل تجربة ناجحة تبني ثقتك في مواجهة تغييرات أكبر."
    },
    "r82": {
      "strength": "انفتاحك على التغيير وعدم مقاومته يدل على مرونتك وتقبلك للتجديد.",
      "weakness": "مقاومة التغيير تستهلك طاقة كبيرة. اسأل نفسك: ما الذي أخافه؟ التعامل مع مصدر الخوف أسهل من مقاومة كل جديد."
    },
    "r83": {
      "strength": "قدرتك على البدء من جديد بعد الفشل تدل على قوتك وإصرارك.",
      "weakness": "البدء من جديد يحتاج شجاعة. لكن تذكر أن كل يوم هو بداية جديدة. ابدأ بخطوة صغيرة اليوم، ولا تنظر للخلف."
    },
    "r84": {
      "strength": "قدرتك على التعافي من الفشل والنهوض من جديد تدل على قوتك وإصرارك.",
      "weakness": "الفشل ليس نهاية العالم. امنح نفسك وقتاً للحزن، ثم تعلم الدرس وامشِ قدماً. تحدث مع من مروا بتجارب مشابهة."
    },
    "r85": {
      "strength": "نظرتك الإيجابية للفشل كمحفز للنجاح تدل على عقليتك النامية والناضجة.",
      "weakness": "الفشل ليس حاجزاً، هو درس. كل عظيم فشل قبل أن ينجح. غير خطتك، لكن لا تغير حلمك."
    },
    "r86": {
      "strength": "قدرتك على النهوض بعد السقوط تدل على قوتك وصلابتك النفسية.",
      "weakness": "النهوض يحتاج وقتاً، لكنه ضروري. ابدأ بخطوة صغيرة اليوم، واطلب الدعم ممن تثق بهم. وحدك أصعب، ومع الآخرين أسهل."
    },
    "r87": {
      "strength": "نظرتك للفشل كفرصة للتعلم والنمو هي عقلية الناجحين والمبدعين.",
      "weakness": "كل فشل يحمل درساً. اسأل نفسك: ماذا تعلمت؟ وكيف سأتصرف مستقبلاً؟ دوّن إجابتك."
    },
    "r88": {
      "strength": "قدرتك على التعلم من أخطائك وعدم تكرارها تدل على نضجك وحكمتك.",
      "weakness": "إذا كنت تكرر الخطأ نفسه، فأنت لم تتعلم الدرس بعد. توقف وحلل: لماذا أكرر هذا الخطأ؟ ما الذي يدفعني له؟"
    },
    "r89": {
      "strength": "إصرارك واستمرارك رغم الصعوبات يدل على عزيمتك القوية وإيمانك بنفسك.",
      "weakness": "ذكر نفسك دائماً بسبب بدايتك. لماذا بدأت هذا المشروع؟ ما هو حلمك الأكبر؟ الصور الذهنية للنجاح تساعد على الاستمرار."
    },
    "r90": {
      "strength": "صبرك وتحملك للوصول إلى أهدافك أو تحقيق نتائج جيدة هي من أعظم صفات الناجحين.",
      "weakness": "الصبر مهارة تكتسب. جرب تمارين الصبر اليومية: انتظر في الطابور بهدوء، تنفس بعمق عندما تشعر بالضيق."
    },
    "r91": {
      "strength": "صبرك على تحقيق أهدافك يدل على إيمانك وقدرتك على الانتظار من أجل ما يستحق.",
      "weakness": "الأشياء العظيمة تحتاج وقتاً. استمتع بالرحلة ولا تركز فقط على الوجهة. كل خطوة صغيرة تقربك من هدفك."
    },
    "r92": {
      "strength": "صبرك وعدم استعجالك للنتائج يدل على نضجك وحكمتك.",
      "weakness": "الأشياء العظيمة تحتاج وقتاً. استمتع بالرحلة ولا تركز فقط على الوجهة. كل خطوة صغيرة تقربك من هدفك."
    },
    "r93": {
      "strength": "قدرتك على الاستمرار في المهام الطويلة دون ملل تدل على صبرك وانضباطك.",
      "weakness": "قسّم المهام الطويلة إلى مراحل صغيرة. احتفل بإنجاز كل مرحلة. كافئ نفسك بعد كل إنجاز."
    },
    "r94": {
      "strength": "إكمالك للمهام والمشاريع حتى النهاية يدل على التزامك وجديتك.",
      "weakness": "لا تتوقف في منتصف الطريق. حتى لو كان التقدم بطيئاً، المهم ألا تتوقف. قسّم ما تبقى من المشوار إلى مراحل صغيرة وأكملها واحدة تلو الأخرى."
    },
    "r95": {
      "strength": "إصرارك وعدم استسلامك حتى تصل لهدفك يدل على عزيمتك القوية.",
      "weakness": "قبل أن تستسلم، ذكر نفسك بسبب بدايتك. لماذا بدأت هذا الهدف؟ ما هو الحلم الذي تسعى لتحقيقه؟"
    },
    "r96": {
      "strength": "وجود قدوة حسنة في حياتك يساعدك على التطور والنمو. استفد من تجاربهم.",
      "weakness": "ابحث عن قدوة حسنة في تحمل المسؤولية. قد يكون أحد الوالدين، أو معلماً، أو شخصية عامة. تعلم من تجاربهم وأخطائهم."
    },
    "r97": {
      "strength": "تعلمك من الأشخاص المسؤولين يدل على حكمتك وتواضعك.",
      "weakness": "راقب الأشخاص المسؤولين في حياتك، ولاحظ كيف يتعاملون مع التحديات. اسألهم عن تجاربهم، واستفد من خبراتهم."
    },
    "r98": {
      "strength": "اختيارك للرفقة المسؤولة يدل على حكمتك ورغبتك في التطور.",
      "weakness": "اختر أصدقاءك بعناية. الرفقة الصالحة تساعدك على النمو وتحمل المسؤولية. كن قريباً من المسؤولين والمجتهدين."
    },
    "r99": {
      "strength": "تأثيرك الإيجابي فيمن حولك يجعلك شخصاً محبوباً وقائداً بالفطرة.",
      "weakness": "التأثير لا يعني الكلام الكبير. ابتسامة في وجه أحدهم، كلمة تشجيع، مساعدة بسيطة. هذه الأفعال الصغيرة هي ما يؤثر حقاً."
    },
    "r100": {
      "strength": "كونك شخصاً يُعتمد عليه هو أعظم شهادة يمكن أن تحصل عليها. حافظ على هذه الثقة الغالية.",
      "weakness": "لكي تكون شخصاً يُعتمد عليه، ابدأ بالالتزام بالمواعيد الصغيرة. كن دقيقاً، نفذ ما تعد به، حتى في أبسط الأمور."
    },
    "c1": {
      "strength": "شجاعتك في مواجهة المشاكل بدلاً من الهروب منها هي الخطوة الأولى والأهم لحلها بفعالية.",
      "weakness": "الهروب يؤجل المشكلة لا يحلها. ابدأ بمواجهة المشاكل الصغيرة أولاً. اختر مشكلة بسيطة وواجهها بهدوء، ستكتسب ثقة لمواجهة الأكبر."
    },
    "c2": {
      "strength": "استماعك للطرف الآخر قبل أن ترد في الخلاف يفتح أبواباً للحلول ويهدئ النفوس.",
      "weakness": "في الخلاف القادم، اجعل هدفك الأول هو الفهم وليس الرد. كرر ما قاله الطرف الآخر: إذاً أنت تقصد أن... وتأكد من فهمك."
    },
    "c3": {
      "strength": "احترامك للآخرين في النقاش حتى في لحظات الخلاف الشديد يرفع من شأنك ويقرب وجهات النظر.",
      "weakness": "الاحترام لا يعني الموافقة. يمكن أن تختلف وتحترم في نفس الوقت. استخدم عبارات مثل: أحترم رأيك، لكني أختلف معك في..."
    },
    "c4": {
      "strength": "بحثك عن حلول وسط ترضي جميع الأطراف يدل على حكمتك ومرونتك وحرصك على العلاقات.",
      "weakness": "الحل الوسط الناجح يحقق شيئاً للجميع. فكر في خيارات مبتكرة. اسأل: ما الحل الذي يحقق لك بعضاً مما تريد ويحقق لي بعضاً مما أريد؟"
    },
    "c5": {
      "strength": "تنازلك في الوقت المناسب عن بعض حقوقك من أجل مصلحة العلاقة يدل على نضجك وحكمتك.",
      "weakness": "التنازل في الأمور الثانوية حكمة، في الأمور الأساسية خسارة. تعلم أن تفرق بينهما. تنازل في ما لا يضر مبادئك."
    },
    "c6": {
      "strength": "حسن ظنك بالآخرين وتبرئتك لذمتهم يريح بالك ويحمي علاقاتك من سوء الفهم.",
      "weakness": "90% من سوء الفهم سببه سوء الظن. ابحث عن تفسيرات إيجابية لتصرفات الآخرين قبل أن تحكم عليهم."
    },
    "c7": {
      "strength": "قدرتك على الفصل بين الماضي والحاضر في الخلافات تدل على نضجك وتركيزك على الحل.",
      "weakness": "ناقش مشكلة واحدة فقط في كل مرة. إذا شعرت برغبة في إحضار الماضي، ذكر نفسك أن هذا الخلاف الحالي هو ما يجب حله الآن."
    },
    "c8": {
      "strength": "طلب المساعدة من مختص ليس عيباً. هو دليل على وعيك وحكمتك.",
      "weakness": "لا تتردد في طلب المساعدة من مختص إذا شعرت أن الخلافات تتكرر ولا تجد حلاً. المختص يرى ما لا تراه."
    },
    "c9": {
      "strength": "قدرتك على تهدئة الخلافات ومنع تفاقمها مهارة ثمينة تجعلك محبوباً في محيطك.",
      "weakness": "عندما تشعر أن الخلاف يتصاعد، بادر بتهدئة الأجواء. غير نبرة صوتك، اقترح استراحة، أو استخدم دعابة لطيفة."
    },
    "c10": {
      "strength": "هدوءك وعدم استثارتك السهلة أثناء النقاش يدل على نضجك وتحكمك في انفعالاتك.",
      "weakness": "إذا شعرت أنك تستثار بسهولة، تدرب على التنفس العميق قبل الرد. ذكر نفسك أن الهدف من النقاش هو الفهم لا الانتصار."
    },
    "c11": {
      "strength": "حكمتك في إيقاف النقاش عندما يشتعل تحمي العلاقة من التدهور.",
      "weakness": "عندما تشعر أن النقاش يخرج عن السيطرة، اقترح وقت مستقطع. قل: أشعر أننا بدأنا نكرر أنفسنا، هل نأخذ استراحة 15 دقيقة ثم نكمل؟"
    },
    "c12": {
      "strength": "قدرتك على العودة للتهدئة بعد الخلاف تدل على نضجك ورغبتك الحقيقية في الحل.",
      "weakness": "العودة بعد التهدئة تظهر نضجك ورغبتك الحقيقية في الحل. لا تترك النقاش معلقاً، عد وأكمله بهدوء."
    },
    "c13": {
      "strength": "مبادرتك بالتصالح بعد الخلاف وعدم انتظار الطرف الآخر يدل على شجاعتك ورغبتك الحقيقية في استمرار العلاقة.",
      "weakness": "المبادرة بالتصالح شجاعة. لا تنتظر الطرف الآخر. من بدأ بالتصالح انتصر على غروره وأنقذ العلاقة."
    },
    "c14": {
      "strength": "قدرتك على ترك الخلافات القديمة وعدم إثارتها من جديد تدل على نضجك وحكمتك.",
      "weakness": "الخلافات القديمة كالجروح الملتئمة. لا تفتحها مرة أخرى. ركز على الحاضر والمستقبل."
    },
    "c15": {
      "strength": "مسامحتك للآخرين وقدرتك على النسيان تدل على سمو أخلاقك وقوة شخصيتك.",
      "weakness": "المسامحة ممكنة، لكن النسيان أصعب. لا بأس أن تتذكر الدرس، لكن لا تستخدم الذكريات كسلاح في الخلافات."
    },
    "c16": {
      "strength": "قدرتك على تجاوز أخطاء الماضي وعدم محاسبة الآخرين عليها تدل على نضجك وسمو أخلاقك.",
      "weakness": "محاسبة الطرف الآخر على أخطاء قديمة تعني أنك لم تسامح حقاً. اترك الماضي للماضي."
    },
    "c17": {
      "strength": "قدرتك على الفصل بين الشخص والمشكلة ونقد السلوك دون تجريح الشخص تدل على نضجك.",
      "weakness": "انتقد المشكلة، ليس الشخص. هذا التصرف أزعجني بدل أنت شخص مزعج. هذا يحافظ على العلاقة."
    },
    "c18": {
      "strength": "تركيزك على نقد الفعل وليس الشخص يدل على نضجك وحرصك على العلاقة.",
      "weakness": "انتقاد الشخص يهدم، انتقاد الفعل يبني. ركز على الفعل: هذا التصرف غير مناسب بدل أنت غير مناسب."
    },
    "c19": {
      "strength": "تجنبك للتعميمات المجحفة في الخلاف يدل على دقتك وإنصافك للآخرين.",
      "weakness": "عبارات أنت دائماً و أنت أبداً تهاجم الشخص وتعمم. تجنبها تماماً. تحدث عن الموقف الحالي فقط."
    },
    "c20": {
      "strength": "تجنبك للتعميمات في الخلاف يدل على دقتك وإنصافك للآخرين.",
      "weakness": "التعميم ظالم. تحدث عن الموقف الحالي بدلاً من استعمال دائماً وأبداً."
    },
    "c21": {
      "strength": "قدرتك على التعبير عن مشاعرك دون هجوم تدل على نضجك العاطفي ومهاراتك التواصلية.",
      "weakness": "استخدم عبارات أنا: أنا أشعر بالضيق عندما... بدل أنت تزعجني. الأول يعبر عن مشاعرك، الثاني يهاجم."
    },
    "c22": {
      "strength": "استخدامك لأسلوب أنا بدل أنت يدل على نضجك التواصلي ورغبتك في الحوار البناء.",
      "weakness": "تدرب على استخدام أنا بدل أنت. أنا أحتاج... بدل أنت لا تعطيني. أنا أشعر... بدل أنت تجعلني أشعر."
    },
    "c23": {
      "strength": "تعبيرك عن مشاعرك بمسؤولية وبدون اتهام يدل على نضجك العاطفي.",
      "weakness": "أنا زعلان أسهل من انت بتزعلني. الأولى تعبر عن مشاعرك، الثانية تهاجم وتلوم."
    },
    "c24": {
      "strength": "محاولتك الدائمة لفهم وجهة نظر الطرف الآخر حتى لو اختلفت معه تدل على انفتاحك ونضجك.",
      "weakness": "اسأل أسئلة مفتوحة: كيف ترى الموقف من وجهة نظرك؟ ما الذي يزعجك بالضبط؟ الفهم نصف الحل."
    },
    "c25": {
      "strength": "استفسارك بهدف الفهم وليس الرد يدل على نضجك التواصلي ورغبتك الحقيقية في الحوار.",
      "weakness": "تدرب على الاستماع التأملي: أنصت، ثم كرر ما فهمت، ثم اسأل إن كان فهمك صحيحاً."
    },
    "c26": {
      "strength": "اعترافك بخطئك أثناء الخلاف وعدم إصرارك على الخطأ ينزع فتيل الأزمة ويظهر نضجك.",
      "weakness": "الاعتراف بالخطأ ينهي الخلاف ويظهر نضجك. لا تنتظر حتى يكتشف الآخر خطأك، بادر أنت بالاعتراف."
    },
    "c27": {
      "strength": "مرونتك وعدم تمسكك برأيك الخاطئ يدل على نضجك وتواضعك.",
      "weakness": "التمسك بالرأي الخاطئ عناد ليس قوة. القوة في الاعتراف بالخطأ وتصحيحه."
    },
    "c28": {
      "strength": "تقبلك لرأي الآخر واحترامك لاختلافه يدل على انفتاحك ونضجك.",
      "weakness": "الاختلاف في الرأي لا يفسد للود قضية. تدرب على تقبل أن للآخرين آراء مختلفة."
    },
    "c29": {
      "strength": "اعترافك بوجهة نظر الآخر يدل على احترامك له وانفتاحك الفكري.",
      "weakness": "الاعتراف بوجهة نظر الآخر لا يعني الموافقة عليها، فقط يعني أنك تفهمها. أفهم وجهة نظرك، لكني أرى الأمر مختلفاً."
    },
    "c30": {
      "strength": "تواضعك وعدم اعتقادك بأنك دائماً على صواب يدل على نضجك وحكمتك.",
      "weakness": "لا أحد على صواب دائماً. تقبل أنك قد تخطئ، واستمع لوجهات النظر الأخرى."
    },
    "c31": {
      "strength": "اختيارك للوقت المناسب للنقاش يدل على حكمتك ومراعاتك لمشاعر الآخرين.",
      "weakness": "لا تناقش في وقت الغضب أو الإرهاق. اختر وقتاً يكون فيه الطرفان هادئين ومستعدين للحوار."
    },
    "c32": {
      "strength": "وعيك بعدم مناقشة الأمور المهمة وأنت متعب أو منزعج يدل على حكمتك.",
      "weakness": "النقاش في حالة التعب أو الانزعاج نادراً ما يأتي بنتيجة إيجابية. انتظر حتى تهدأ وتكون في حالة أفضل."
    },
    "c33": {
      "strength": "اختيارك لمكان مناسب للنقاش يدل على حكمتك وحرصك على خصوصية الحوار.",
      "weakness": "اختر مكاناً هادئاً وخاصاً للنقاش. تجنب الأماكن العامة أو الأماكن التي تشتت الانتباه."
    },
    "c34": {
      "strength": "حرصك على خصوصية النقاش وعدم إجرائه أمام الناس يدل على حكمتك.",
      "weakness": "النقاش أمام الناس يزيد التوتر. اختر مكاناً خاصاً هادئاً للحديث عن الخلافات."
    },
    "c35": {
      "strength": "حرصك على خصوصية الخلافات وعدم إشراك الآخرين فيها يدل على نضجك وحكمتك.",
      "weakness": "الخلافات خاصة جداً. لا تشرك أحداً فيها، حتى الأهل. حلها بينكما أفضل."
    },
    "c36": {
      "strength": "حرصك على عدم إشراك الآخرين في مشاكلك الخاصة يدل على نضجك وحكمتك.",
      "weakness": "مشاكلك الخاصة يجب أن تبقى خاصة. إشراك الآخرين قد يزيدها تعقيداً. اختر مستشاراً موثوقاً إذا احتجت مساعدة."
    },
    "c37": {
      "strength": "استشارتك لأهل الخبرة قبل حل الخلافات تدل على حكمتك وتواضعك.",
      "weakness": "لا بأس في استشارة شخص تثق به إذا شعرت أنك بحاجة لرأي آخر. اختر مستشاراً حكيماً وموضوعياً."
    },
    "c38": {
      "strength": "ثقتك بنفسك وعدم تأثرك بكلام الناس في مشاكلك الخاصة يدل على نضجك.",
      "weakness": "استمع لنفسك أولاً. كلام الناس قد يكون متضارباً ويشتتك. ثق بحكمتك الداخلية."
    },
    "c39": {
      "strength": "قدرتك على وضع حدود تمنع تدخل الآخرين في مشاكلك الخاصة يدل على حكمتك.",
      "weakness": "ضع حدوداً واضحة مع الآخرين. أخبرهم بلطف أنك تفضل حل مشاكلك بنفسك."
    },
    "c40": {
      "strength": "اعتمادك على نفسك في حل مشاكلك يدل على نضجك واستقلاليتك.",
      "weakness": "الاعتماد على النفس في حل المشاكل مهارة مهمة، لكن لا تتردد في طلب المساعدة إذا احتجت."
    },
    "c41": {
      "strength": "طلب المساعدة عند الحاجة يدل على نضجك ووعيك بحدود قدراتك.",
      "weakness": "لا تتردد في طلب المساعدة إذا شعرت أنك بحاجة لها. طلب المساعدة ليس ضعفاً، بل هو وعي وحكمة."
    },
    "c42": {
      "strength": "تقبلك للمساعدة من الآخرين يدل على تواضعك وانفتاحك.",
      "weakness": "تقبل المساعدة يمنح الآخر فرصة للعطاء ويقوي العلاقات. لا ترفض كل مساعدة، وتعلم أن تأخذ وتعطي."
    },
    "c43": {
      "strength": "استفادتك من تجارب الآخرين تدل على حكمتك وتواضعك.",
      "weakness": "اسأل من مروا بتجارب مشابهة عن تجاربهم، واستفد من أخطائهم ونجاحاتهم."
    },
    "c44": {
      "strength": "تعلمك من أخطائك في الخلافات يدل على نضجك وتطورك المستمر.",
      "weakness": "كل خلاف يحمل درساً. اسأل نفسك: ماذا تعلمت من هذا الخلاف؟ كيف يمكنني تجنبه مستقبلاً؟"
    },
    "c45": {
      "strength": "قدرتك على التعلم من أخطائك في الخلافات وعدم تكرارها تدل على نضجك.",
      "weakness": "إذا كنت تكرر نفس الأخطاء، فأنت لم تتعلم الدرس بعد. توقف وحلل السبب الحقيقي."
    },
    "c46": {
      "strength": "قدرتك على تحليل المشكلة وإيجاد حل يمنع تكرارها تدل على نضجك وحكمتك.",
      "weakness": "لحل المشكلة من جذورها، اسأل: لماذا حدثت؟ ما السبب الحقيقي؟ كيف نمنعها مستقبلاً؟"
    },
    "c47": {
      "strength": "قدرتك على تحليل المشكلة والوصول إلى جذورها تدل على نضجك وحكمتك.",
      "weakness": "لا تكتفي بحل الأعراض. ابحث عن السبب الحقيقي للمشكلة، وركز على حله."
    },
    "c48": {
      "strength": "وعيك بأهمية معالجة أسباب المشكلة وليس أعراضها فقط يدل على نضجك.",
      "weakness": "علاج الأعراض مؤقت. ابحث عن الأسباب الحقيقية للمشكلة وركز على حلها."
    },
    "c49": {
      "strength": "تحليلك لسبب الخلاف قبل الشروع في حله يدل على حكمتك ووعيك.",
      "weakness": "قبل أن تحاول حل الخلاف، اسأل: ما السبب الحقيقي له؟ فهم السبب نصف الحل."
    },
    "c50": {
      "strength": "قدرتك على الوصول إلى جذور الخلافات تدل على عمق تفكيرك وحكمتك.",
      "weakness": "أحياناً يكون السبب الظاهر غير السبب الحقيقي. اسأل نفسك والآخرين أسئلة أعمق للوصول إلى الجوهر."
    },
    "c51": {
      "strength": "قدرتك على تهدئة نفسك عند الانزعاج تدل على نضجك العاطفي وتحكمك في انفعالاتك.",
      "weakness": "عندما تشعر بالانزعاج، خذ نفساً عميقاً. تنفس ببطء عدة مرات. هذا سيساعدك على الهدوء والتفكير بوضوح."
    },
    "c52": {
      "strength": "قدرتك على تهدئة الطرف الآخر في الخلاف تدل على ذكائك العاطفي ومهاراتك التواصلية.",
      "weakness": "إذا كان الطرف الآخر منفعلاً، تحدث بنبرة هادئة. استخدم عبارات تفهم مشاعره. هذا يساعد على تهدئته."
    },
    "c53": {
      "strength": "استخدامك للفكاهة في الوقت المناسب لتهدئة الموقف يدل على ذكائك الاجتماعي.",
      "weakness": "الفكاهة سلاح ذو حدين. استخدمها بحذر في الخلافات. دعابة لطيفة قد تزيل التوتر، لكن تجنب السخرية."
    },
    "c54": {
      "strength": "قدرتك على كسر الجمود في الخلافات تدل على ذكائك الاجتماعي ومهاراتك القيادية.",
      "weakness": "إذا توقف النقاش عند نقطة مسدودة، اقترح استراحة. أو حاول تغيير الموضوع قليلاً ثم العودة."
    },
    "c55": {
      "strength": "قدرتك على العودة للنقاش بعد التهدئة تدل على نضجك ورغبتك الحقيقية في الحل.",
      "weakness": "لا تترك النقاش معلقاً. بعد أن تهدأ الأجواء، عاد لإكمال الحوار بهدوء وتركيز على الحل."
    },
    "c56": {
      "strength": "قدرتك على إيجاد حلول ترضي الجميع تدل على حكمتك وذكائك الاجتماعي.",
      "weakness": "ابحث عن حل مربح للجميع. اسأل: ما الذي يريده كل طرف حقاً؟ كيف يمكن تلبية الاحتياجات الأساسية للجميع؟"
    },
    "c57": {
      "strength": "اهتمامك بمصلحة الجميع وليس مصلحتك فقط يدل على نضجك وعدالتك.",
      "weakness": "التركيز على مصلحتك فقط يطيل الخلاف ويصعب الحل. حاول أن ترى الصورة الكبيرة وتفكر في مصلحة الجميع."
    },
    "c58": {
      "strength": "تفكيرك في مصلحة الطرف الآخر حتى في الخلاف يدل على إنسانيتك ونبلك.",
      "weakness": "حاول أن تضع نفسك مكان الطرف الآخر. ماذا يريد؟ ما الذي يقلقه؟ فهم احتياجاته يسهل الوصول لحل."
    },
    "c59": {
      "strength": "تركيزك على مصلحة العلاقة ككل وليس على مكسبك الشخصي هو سر نجاح علاقاتك الدائمة.",
      "weakness": "في أي خلاف، اسأل نفسك: ما هو الأفضل للعلاقة على المدى الطويل؟ هذا السؤال يوجهك نحو الحل الصحيح."
    },
    "c60": {
      "strength": "استعدادك للتضحية ببعض رغباتك من أجل من تحب يدل على حبك الحقيقي وإخلاصك.",
      "weakness": "التضحية المتبادلة تبني العلاقات. إذا كنت أنت من تضحي دائماً، ناقش ذلك بلطف مع الطرف الآخر."
    },
    "c61": {
      "strength": "تقديرك لموقف الطرف الآخر يدل على تعاطفك وإنسانيتك.",
      "weakness": "حاول أن ترى الموقف من عيون الآخر. ما الذي يشعر به؟ ما التحديات التي يواجهها؟ هذا الفهم يقربك من الحل."
    },
    "c62": {
      "strength": "تقديرك لظروف الطرف الآخر يدل على نضجك وتفهمك.",
      "weakness": "كل شخص له ظروفه الخاصة. حاول أن تتفهم ظروف الآخر قبل أن تصدر أحكاماً."
    },
    "c63": {
      "strength": "تفكيرك في مشاعر الطرف الآخر حتى في الخلاف يدل على تعاطفك العميق.",
      "weakness": "قبل أن ترد أو تتصرف، اسأل نفسك: كيف سيشعر الطرف الآخر؟ هذا التعاطف يوجهك للتصرف بلطف."
    },
    "c64": {
      "strength": "رعايتك لمشاعر الطرف الآخر حتى في الخلاف يدل على نضجك وإنسانيتك.",
      "weakness": "حافظ على نبرة صوتك هادئة، واختر كلماتك بعناية. تذكر أن الكلمات قد تترك جرحاً أعمق مما تتصور."
    },
    "c65": {
      "strength": "حرصك على عدم جرح مشاعر الآخرين حتى في الخلاف يدل على نضجك وأخلاقك.",
      "weakness": "الجروح اللفظية قد لا تلتئم. قبل أن تتكلم، اسأل نفسك: هل كلامي سيساعد أم سيؤذي؟"
    },
    "c66": {
      "strength": "مبادرتك بالاعتذار إذا جرحت أحداً تدل على شجاعتك الأخلاقية واهتمامك بمشاعر الآخرين.",
      "weakness": "إذا جرحت أحداً، اعتذر فوراً. لا تبرر، لا تشرح. فقط قل: آسف، كان خطأً مني، سأحرص على عدم تكراره."
    },
    "c67": {
      "strength": "مسامحتك للآخرين حتى إذا جرحت تدل على سمو أخلاقك وقوة شخصيتك.",
      "weakness": "المسامحة قرار، ليس شعوراً. قرر أن تسامح حتى لو لم تشعر بالرغبة. المشاعر ستتبع القرار مع الوقت."
    },
    "c68": {
      "strength": "صفاء قلبك وعدم حملك للضغائن بعد الخلافات يدل على نضجك وسمو أخلاقك.",
      "weakness": "الضغينة كسم تشربه وأنت تنتظر أن يموت الآخر. أنت أول من يتأذى. قرر أن تسامح وتتخلص من هذا العبء الثقيل."
    },
    "c69": {
      "strength": "قدرتك على فتح صفحة جديدة بعد الخلاف وعدم استحضار الماضي تدل على نضجك وحكمتك.",
      "weakness": "إذا انتهى الخلاف، فليكن انتهى حقاً. لا تستحضر الماضي في كل خلاف جديد. ابدأ من جديد."
    },
    "c70": {
      "strength": "قدرتك على التعامل الطبيعي بعد الخلاف تدل على نضجك وتجاوزك للمشاكل.",
      "weakness": "تعامل مع الشخص بشكل طبيعي بعد انتهاء الخلاف. لا تجعله يشعر أنك مازلت غاضباً أو متحفظاً."
    },
    "c71": {
      "strength": "قدرتك على ترك الخلافات وعدم العودة إليها تدل على نضجك.",
      "weakness": "العودة للخلاف بعد انتهائه تعيد فتح الجروح. إذا انتهى الخلاف، فليكن انتهى حقاً."
    },
    "c72": {
      "strength": "قدرتك على تجاوز الانزعاج بعد الخلاف والعودة لحياتك الطبيعية تدل على صحتك النفسية.",
      "weakness": "الاستمرار في الانزعاج بعد انتهاء الخلاف يسمم حياتك. سامح وتجاوز، فالحياة أقصر من أن تضيع في الأحقاد."
    },
    "c73": {
      "strength": "حرصك على عدم مقاطعة الآخرين بعد الخلاف يدل على نضجك وحكمتك.",
      "weakness": "المقاطعة بعد الخلاف تزيد الأمور سوءاً. تواصل مع الشخص بهدوء، وتحدثا عن حل الخلاف."
    },
    "c74": {
      "strength": "قدرتك على تجاوز الخلاف دون عقاب تدل على نضجك وسمو أخلاقك.",
      "weakness": "العقاب يسمم العلاقة. إذا انتهى الخلاف، فليكن انتهى حقاً. التعامل الطبيعي يبني الثقة ويعيد الدفء."
    },
    "c75": {
      "strength": "مبادرتك السريعة بالتصالح تدل على شجاعتك ورغبتك في استمرار العلاقة.",
      "weakness": "لا تؤخر الصلح. كلما أسرعت بالتصالح، كلما كان أفضل للعلاقة. الشجاعة في المبادرة."
    },
    "c76": {
      "strength": "قدرتك على نسيان الخلافات وعدم استحضارها تدل على صفاء قلبك ونقاء سريرتك.",
      "weakness": "نسيان الخلافات صعب، لكن حاول ألا تستحضرها في كل نقاش. تعلم الدرس وامشِ قدماً."
    },
    "c77": {
      "strength": "قدرتك على التعامل مع الخلافات دون أن تؤثر سلباً على نفسيتك تدل على قوتك الداخلية.",
      "weakness": "الخلافات تؤثر على الجميع، لكن المهم ألا تدعها تسيطر عليك. خذ وقتك للتهدئة، وتذكر أن الخلافات جزء طبيعي من العلاقات."
    },
    "c78": {
      "strength": "قدرتك على الفصل بين الخلافات الشخصية وعملك وإنتاجيتك تدل على نضجك.",
      "weakness": "حاول ألا تدع الخلافات الشخصية تؤثر على عملك. خصص وقتاً للخلاف، ووقتاً للعمل، ولا تخلط بينهما."
    },
    "c79": {
      "strength": "قدرتك على عزل تأثير الخلافات ومنع تسربها لعلاقاتك الأخرى تدل على نضجك.",
      "weakness": "لا تدع خلافاً مع شخص يؤثر على علاقاتك مع الآخرين. تعامل مع كل علاقة بشكل منفصل."
    },
    "c80": {
      "strength": "قدرتك على عزل الخلاف عن باقي جوانب العلاقة تدل على نضجك.",
      "weakness": "لا تدع خلافاً واحداً يسمم كل العلاقة. تذكر الأوقات الجميلة، ولا تجعل خلافاً واحداً يمحو كل شيء."
    },
    "c81": {
      "strength": "قدرتك على عزل الخلاف وعدم تعميمه على العلاقة كلها تدل على نضجك.",
      "weakness": "تعامل مع الخلاف كمشكلة منفصلة، وليس كحكم على العلاقة كلها. هذا يساعد على حل المشكلة دون تهديد العلاقة."
    },
    "c82": {
      "strength": "تحديدك لأولوياتك في الخلافات يدل على وضوح رؤيتك وحكمتك.",
      "weakness": "اسأل نفسك: ما المهم حقاً في هذا الخلاف؟ ما الذي يمكن التغاضي عنه؟ التركيز على الجوهر يوفر الوقت والجهد."
    },
    "c83": {
      "strength": "حكمتك في اختيار المعارك التي تخوضها تدل على نضجك وذكائك.",
      "weakness": "لا تدخل في كل معركة. اختر معاركك بحكمة. بعض الأمور لا تستحق الوقت والجهد."
    },
    "c84": {
      "strength": "انتقاؤك لما تقوله في الخلافات يدل على حكمتك وذكائك الاجتماعي.",
      "weakness": "ليس كل ما يخطر ببالك يجب أن تقوله. انتق كلماتك بعناية. اسأل نفسك: هل هذا الكلام مفيد؟ هل سيساعد في الحل؟"
    },
    "c85": {
      "strength": "حكمتك في اختيار وقت الصمت تدل على نضجك وذكائك الاجتماعي.",
      "weakness": "الصمت في بعض الأحيان أبلغ من الكلام. إذا شعرت أن الكلام سيزيد الموقف سوءاً، فالصمت هو الخيار الأفضل."
    },
    "c86": {
      "strength": "حكمتك في اختيار وقت التحدث تدل على نضجك وفهمك للعلاقات.",
      "weakness": "اختر الوقت المناسب للحديث عن الخلاف. وقت الغضب ليس وقتاً مناسباً. انتظر حتى تهدأ الأجواء."
    },
    "c87": {
      "strength": "حكمتك في اختيار وقت التنازل تدل على نضجك وفهمك العميق للعلاقات.",
      "weakness": "التنازل ليس ضعفاً. اختر وقت التنازل بحكمة. تنازل في الأمور الثانوية، وتمسك بمبادئك في الأمور الأساسية."
    },
    "c88": {
      "strength": "حكمتك في اختيار وقت التمسك بموقفك تدل على وضوح مبادئك وثباتك.",
      "weakness": "تمسك بموقفك في الأمور المبدئية والمهمة. لا تتراجع عن قيمك ومبادئك الأساسية."
    },
    "c89": {
      "strength": "حكمتك في التعامل مع الخلافات تدل على نضجك وذكائك العاطفي.",
      "weakness": "الحكمة تأتي من التجربة. تعلم من كل خلاف تمر به، وطور أسلوبك باستمرار."
    },
    "c90": {
      "strength": "تعلمك من كل خلاف تدل على نضجك وتطورك المستمر.",
      "weakness": "كل خلاف يحمل درساً. اسأل نفسك بعد كل خلاف: ماذا تعلمت؟ كيف يمكنني تحسين أسلوبي في المستقبل؟"
    },
    "c91": {
      "strength": "سعيك الدائم لتطوير أسلوبك في حل الخلافات يدل على نضجك ورغبتك في النمو.",
      "weakness": "اقرأ عن مهارات حل الخلافات، وتعلم من تجارب الآخرين. طور أسلوبك باستمرار."
    },
    "c92": {
      "strength": "وجود قدوة حسنة في حياتك يساعدك على تعلم مهارات حل الخلافات.",
      "weakness": "ابحث عن قدوة حسنة في حل الخلافات. لاحظ كيف يتعاملون مع الخلافات، وتعلم من حكمتهم."
    },
    "c93": {
      "strength": "حرصك على التعلم والقراءة عن مهارات حل الخلافات يدل على نضجك ورغبتك في التطور.",
      "weakness": "اقرأ كتاباً أو مقالاً عن مهارات التواصل وحل الخلافات. المعرفة النظرية تساعدك على التطبيق العملي."
    },
    "c94": {
      "strength": "تدربك على حل الخلافات يدل على وعيك وإدراكك لأهمية هذه المهارة.",
      "weakness": "التدريب العملي هو الأفضل. ابدأ بحل الخلافات الصغيرة في حياتك اليومية، وتعلم من كل تجربة."
    },
    "c95": {
      "strength": "طلبك للتغذية الراجعة عن أدائك في الخلافات يدل على تواضعك ورغبتك في التطور.",
      "weakness": "اسأل من تثق بهم عن رأيهم في أسلوبك في الخلافات. استمع لملاحظاتهم بتواضع، واستفد منها."
    },
    "c96": {
      "strength": "تقبلك للنقد في طريقة تعاملك مع الخلافات يدل على تواضعك ورغبتك في التحسن.",
      "weakness": "تقبل النقد بروح رياضية. اسأل نفسك: ما الذي يمكنني تعلمه من هذا النقد؟ كيف يمكنني تحسين أسلوبي؟"
    },
    "c97": {
      "strength": "مرونتك في تغيير أسلوبك بناءً على النقد البناء تدل على نضجك وحكمتك.",
      "weakness": "النقد فرصة للتطور. جرب تطبيق الاقتراحات المفيدة، وغير أسلوبك تدريجياً."
    },
    "c98": {
      "strength": "وعيك بنقاط قوتك وضعفك في الخلافات يدل على نضجك ووعيك الذاتي.",
      "weakness": "حلل أداءك بعد كل خلاف. ما هي نقاط قوتك؟ ما الذي تحتاج لتحسينه؟ الوعي بالذات هو بداية التغيير."
    },
    "c99": {
      "strength": "سعيك الدائم لتطوير نفسك في إدارة الخلافات يدل على نضجك ورغبتك في النمو.",
      "weakness": "حدد هدفاً لتطوير نفسك في إدارة الخلافات. ركز على نقطة ضعف واحدة كل مرة، واعمل على تحسينها."
    },
    "c100": {
      "strength": "سلميتك وحبك للسلام والهدوء يجعلك شخصاً محبوباً ومريحاً في التعامل.",
      "weakness": "السلمية صفة رائعة، لكن تذكر أن السلام الحقيقي لا يعني تجنب الخلافات، بل يعني التعامل معها بحكمة."
    },
    "f1": {
      "strength": "امتلاكك مصدر دخل ثابت ومستقر يمنحك استقراراً نفسياً وقدرة على التخطيط للمستقبل بثقة.",
      "weakness": "ابدأ بالبحث عن فرص عمل جانبية تتناسب مع مهاراتك. حتى المشاريع الصغيرة يمكن أن تبني دخلاً إضافياً."
    },
    "f2": {
      "strength": "تحكمك في مصاريفك وعدم إنفاقك أكثر من دخلك هو أساس الاستقرار المالي والنجاح.",
      "weakness": "سجل كل مصروفاتك لمدة شهر. استخدم تطبيقاً مثل Money Manager. المفاجأة كبيرة! ستعرف أين تذهب أموالك."
    },
    "f3": {
      "strength": "عادة الادخار التي تمتلكها هي سر بناء الثروة والأمان المالي على المدى الطويل. استمر فيها.",
      "weakness": "جرب قاعدة 50/30/20: 50% للضروريات، 30% للكماليات، 20% للادخار. ابدأ فوراً حتى بمبلغ بسيط."
    },
    "f4": {
      "strength": "قدرتك على إدارة ديونك وعدم تراكمها ممتازة. هذا يدل على وعيك المالي وحكمتك.",
      "weakness": "واجه ديونك. اكتب كل الديون التي عليك من الأصغر إلى الأكبر. ابدأ بسداد أصغر دين أولاً مع دفع الحد الأدنى للباقي. طريقة كرة الثلج."
    },
    "f5": {
      "strength": "وعيك بالفرق بين ما تحتاجه حقاً وما هو مجرد كماليات يحميك من التبذير والديون.",
      "weakness": "قبل الشراء، اسأل: هل أحتاج هذا أم أريده فقط؟ الضروري تحتاجه، الكمالي تريده فقط. انتظر 24 ساعة قبل شراء الكماليات."
    },
    "f6": {
      "strength": "قدرتك على تحمل التزامات مالية طويلة تدل على استقرارك المالي وثقتك في مستقبلك.",
      "weakness": "قبل الدخول في أي التزام مالي طويل، ادرس جميع الخيارات، وتأكد من قدرتك على الوفاء به على المدى الطويل."
    },
    "f7": {
      "strength": "تخطيطك للمستقبل المالي ووضعك أهدافاً مالية واضحة يدل على وعيك المالي العالي وبعد نظرك.",
      "weakness": "اكتب أهدافك المالية: قصيرة المدى سنة، متوسطة 5 سنوات، طويلة المدى أكثر. الهدف المكتوب يزيد فرص تحقيقه."
    },
    "f8": {
      "strength": "استقلالك المادي وعدم اعتمادك على الآخرين يدل على نضجك ومسؤوليتك وقدرتك على إدارة حياتك.",
      "weakness": "الاستقلال المالي حلم. ابدأ بمشروع صغير جانبي. هوايتك قد تكون مصدر دخل. حدد هدفاً وابدأ بخطوات صغيرة."
    },
    "f9": {
      "strength": "وضعك لميزانية شهرية يدل على انضباطك المالي وتنظيمك الجيد لأموالك.",
      "weakness": "ضع ميزانية شهرية واقعية. راجعها أسبوعياً لترى إن كنت ملتزماً بها. الميزانية خريطة طريقك المالية."
    },
    "f10": {
      "strength": "التزامك بالميزانية يدل على انضباطك المالي وحكمتك في إدارة أموالك.",
      "weakness": "راجع ميزانيتك أسبوعياً، وتتبع مصروفاتك. هذا يساعدك على الالتزام بها وتعديلها إذا لزم الأمر."
    },
    "f11": {
      "strength": "امتلاكك لحساب توفير يدل على وعيك المالي وحرصك على مستقبلك.",
      "weakness": "افتح حساب توفير منفصل. حول إليه مبلغاً شهرياً ولو صغيراً. الأهم هو الاستمرارية."
    },
    "f12": {
      "strength": "تفكيرك في الاستثمار وتنمية أموالك خطوة ذكية جداً نحو بناء ثروة مستقبلية.",
      "weakness": "ابدأ بالتعلم. استثمر في معرفتك المالية أولاً. اقرأ كتباً، تابع قنوات متخصصة، اسأل أصحاب الخبرة. الاستثمار بدون معرفة قد يكون خطيراً."
    },
    "f13": {
      "strength": "امتلاكك لأصول يدل على تخطيطك المالي الجيد ونظرتك للمستقبل.",
      "weakness": "الأصول ما تملك، الخصوم ما عليك. ابنِ الأصول. حتى لو بدأت بسيطة."
    },
    "f14": {
      "strength": "امتلاكك لممتلكات يدل على استقرارك المالي ونجاحك في بناء قاعدة مالية صلبة.",
      "weakness": "الممتلكات قد تكون أصولاً أو خصوماً. السيارة أصل؟ السيارة تستهلك وقوداً وصيانة. فكر جيداً قبل الشراء."
    },
    "f15": {
      "strength": "اهتمامك بالتأمين الصحي يدل على وعيك وحرصك على صحتك ومستقبلك.",
      "weakness": "التأمين الصحي ضروري. مرض واحد قد يكلفك سنوات ادخار. ابحث عن تأمين مناسب."
    },
    "f16": {
      "strength": "اهتمامك بالتأمين على الحياة يدل على مسؤوليتك تجاه أسرتك وتفكيرك في المستقبل.",
      "weakness": "التأمين على الحياة حماية لأسرتك. فكر فيه خاصة إذا كنت معيلاً للأسرة."
    },
    "f17": {
      "strength": "امتلاكك خطة للطوارئ المالية وصندوقاً للطوارئ يمنحك راحة البال ويحميك من صدمات الحياة.",
      "weakness": "صندوق الطوارئ = 3-6 شهور من المصاريف الأساسية. ابدأ في بنائه اليوم، حتى لو بمبلغ صغير شهرياً."
    },
    "f18": {
      "strength": "قدرتك على العيش 6 أشهر بدون دخل تدل على استقرارك المالي وتخطيطك الجيد.",
      "weakness": "صندوق الطوارئ يمنحك راحة البال. اجعل هدفك توفير 3 أشهر أولاً."
    },
    "f19": {
      "strength": "وعيك المالي العالي هو أساس نجاحك في إدارة أموالك وتحقيق أهدافك المالية.",
      "weakness": "اقرأ كتاباً واحداً عن المالية الشخصية. المعرفة المالية قوة."
    },
    "f20": {
      "strength": "حرصك على القراءة في المواضيع المالية يدل على رغبتك في تطوير وعيك المالي باستمرار.",
      "weakness": "خصص 15 دقيقة يومياً للتعلم المالي. اليوتيوب مليء بقنوات رائعة."
    },
    "f21": {
      "strength": "استشارتك لمتخصصين ماليين تدل على حكمتك ووعيك بأهمية الخبرة المتخصصة.",
      "weakness": "استشارة متخصص مالي توفر عليك أخطاء كثيرة. لا تتردد."
    },
    "f22": {
      "strength": "وجود أهداف مالية واضحة ومحددة يوجه قراراتك المالية ويساعدك على تحقيق أحلامك.",
      "weakness": "اجلس اليوم واكتب هدفاً مالياً واحداً واضحاً. اجعله محدداً وقابلاً للقياس. أريد توفير 1000 دولار خلال سنة."
    },
    "f23": {
      "strength": "سعيك الدؤوب لتحقيق أهدافك المالية يدل على إصرارك وطموحك.",
      "weakness": "قسّم هدفك الكبير إلى أهداف أسبوعية صغيرة. ركز على الهدف الصغير لهذا الأسبوع. الإنجازات الصغيرة تبني زخماً."
    },
    "f24": {
      "strength": "قدرتك على مقاومة الشراء العشوائي والتركيز على الضروري يدل على نضجك المالي.",
      "weakness": "طبق قاعدة 30 يوماً: إذا أردت شراء شيء غير ضروري، انتظر 30 يوماً. ستجد أن 90% من الرغبات تزول."
    },
    "f25": {
      "strength": "قلة ندمك على مشترياتك يدل على حكمتك في الاختيار وعدم اندفاعك.",
      "weakness": "فكر قبل الشراء. الندم علامة على الشراء الاندفاعي."
    },
    "f26": {
      "strength": "قلة مقارنتك لنفسك بالآخرين في الماديات يدل على رضاك عن نفسك وثقتك.",
      "weakness": "قارن نفسك بنفسك القديمة فقط. طريق التعاسة هو مقارنة نفسك بغيرك."
    },
    "f27": {
      "strength": "ثقتك بنفسك وعدم احتياجك لشراء انطباع الآخرين يدل على نضجك.",
      "weakness": "شراء انطباع الآخرين غالٍ جداً. كن أنت ولا تشترِ أن تكون غيرك."
    },
    "f28": {
      "strength": "توازنك في تقدير الأمور المادية دون إفراط أو تفريط يدل على نضجك.",
      "weakness": "الماديات مهمة، لكنها ليست كل شيء. التوازن مع القيم والعلاقات أهم."
    },
    "f29": {
      "strength": "تفكيرك في الجانب المادي قبل الزواج يدل على مسؤوليتك وتخطيطك للمستقبل.",
      "weakness": "ناقش الجانب المالي قبل الزواج بشفافية. هذا يمنع صدمات وصدامات بعد الزواج."
    },
    "f30": {
      "strength": "وجود تصور واضح للمصاريف بعد الزواج يدل على تخطيطك الجيد ووعيك.",
      "weakness": "ضع تصوراً واقعياً للمصاريف بعد الزواج. الحياة أغلى مما تتوقع. ابحث عن تجارب الآخرين."
    },
    "f31": {
      "strength": "قدرتك على إدارة ميزانية منزل تدل على مهاراتك المالية العالية ومسؤوليتك.",
      "weakness": "إدارة ميزانية البيت تحتاج شفافية وتعاوناً بين الزوجين. اتفقا على نظام واضح."
    },
    "f32": {
      "strength": "قدرتك على توفير احتياجات أسرة تدل على استقرارك المالي ونجاحك.",
      "weakness": "توفير احتياجات الأسرة مسؤولية مشتركة. ناقشاها معاً ووزعا المهام."
    },
    "f33": {
      "strength": "قدرتك على تأمين مستقبل الأبناء تدل على تخطيطك المالي الجيد ومسؤوليتك.",
      "weakness": "التخطيط لمستقبل الأبناء يبدأ مبكراً. ادخر واستثمر لأجلهم ولو بمبلغ صغير."
    },
    "f34": {
      "strength": "وجود خطة لتعليم الأبناء يدل على تخطيطك المالي الجيد ونظرتك للمستقبل.",
      "weakness": "التعليم أغلى استثمار. ابحث عن خطط ادخار تعليمية مناسبة."
    },
    "f35": {
      "strength": "وجود خطة للسكن بعد الزواج يدل على تخطيطك الجيد ومسؤوليتك.",
      "weakness": "السكن قرار كبير. لا تتعجل، وادرس الخيارات المتاحة بعناية. الإيجار قد يكون أفضل."
    },
    "f36": {
      "strength": "قدرتك على شراء أو استئجار مسكن تدل على استقرارك المالي واستقلاليتك.",
      "weakness": "احسب التكلفة طويلة المدى. الشراء ليس دائماً أفضل من الإيجار."
    },
    "f37": {
      "strength": "قدرتك على توفير احتياجات الزوجة تدل على مسؤوليتك واستقرارك المالي.",
      "weakness": "احتياجات الزوجة ليست ترفاً. اتفقا على ميزانية مناسبة وشفافة."
    },
    "f38": {
      "strength": "قدرتك على توفير احتياجات الأبناء تدل على نجاحك واستقرارك المالي.",
      "weakness": "ضع بنداً للأولاد في ميزانيتك. احتياجاتهم تتغير مع الوقت."
    },
    "f39": {
      "strength": "حكمتك في التعامل مع الأزمات المالية تدل على نضجك وخبرتك.",
      "weakness": "الأزمات المالية تكشف قوة تخطيطك. صندوق الطوارئ هو المنقذ. ابدأ ببنائه."
    },
    "f40": {
      "strength": "تنويعك لمصادر دخلك وعدم اعتمادك على مصدر واحد فقط هو سر الأمان المالي الحقيقي.",
      "weakness": "لا تضع كل بيضك في سلة واحدة. مصادر دخل متعددة = أمان مالي."
    },
    "f41": {
      "strength": "استقرارك على مصدر دخل واحد ليس عيباً إذا كنت تخطط لمستقبلك وتدخر.",
      "weakness": "طور مصدراً آخر ولو صغيراً. عمل حر، استثمار صغير، مشروع جانبي."
    },
    "f42": {
      "strength": "امتلاكك دخل إضافي يدل على طموحك وسعيك لتحسين وضعك المالي.",
      "weakness": "الدخل الإضافي يمكن أن يكون هواية تدرّ ربحاً. ماذا تجيد؟"
    },
    "f43": {
      "strength": "تفكيرك المستمر في مصادر دخل جديدة يدل على طموحك وعقليتك الريادية.",
      "weakness": "استمر في التفكير والتخطيط. الجديد يبقيك متقدماً."
    },
    "f44": {
      "strength": "سعيك لتطوير مهاراتك لزيادة دخلك يدل على طموحك ووعيك.",
      "weakness": "استثمر في نفسك. تطوير مهاراتك = زيادة دخلك."
    },
    "f45": {
      "strength": "شغفك بتعلم مهارات جديدة يزيد من قيمتك وفرصك في الحياة.",
      "weakness": "تعلم مهارة جديدة كل عام يضيف لك مصدر دخل محتمل."
    },
    "f46": {
      "strength": "سعيك للترقية في عملك يدل على طموحك ورغبتك في التطور.",
      "weakness": "حدد ما يميزك وطوره. الترقية تحتاج تميزاً."
    },
    "f47": {
      "strength": "طموحك المالي الصحي يدفعك للتطور والتقدم في حياتك المهنية.",
      "weakness": "الطموح المالي الصحي يدفعك للتطور. المفرط يرهقك."
    },
    "f48": {
      "strength": "طموحك للثراء يدفعك للعمل بجد، لكن تذكر أن المال وسيلة وليس غاية.",
      "weakness": "ركز على تقديم قيمة. الثراء نتيجة، ليس هدفاً."
    },
    "f49": {
      "strength": "نظرتك للمال كوسيلة وليس هدفاً تدل على نضجك وفلسفتك الحياتية المتوازنة.",
      "weakness": "المال وسيلة لتحقيق أهدافك، ليس هدفاً بحد ذاته."
    },
    "f50": {
      "strength": "تعاملك الصحي مع الخوف من الفقر يدل على ثقتك بنفسك وقدراتك.",
      "weakness": "خطط لتزول أسباب القلق. الخوف بدون تخطيط لا يفيد."
    },
    "f51": {
      "strength": "تخطيطك المالي الجيد يقلل من قلقك على المستقبل. هذا يدل على وعيك.",
      "weakness": "واجه الأسباب ولا تهرب. التوتر المالي يؤثر على صحتك وعلاقاتك."
    },
    "f52": {
      "strength": "قدرتك على التعامل مع التوتر المالي دون أن يؤثر على نفسيتك تدل على قوتك.",
      "weakness": "خفض المصاريف، زد الدخل، نظم الديون. واجه أسبابه."
    },
    "f53": {
      "strength": "قدرتك على التعامل مع الضغوط المالية بهدوء وحكمة تدل على نضجك.",
      "weakness": "واجه الضغوط المالية بخطة واضحة. نظم ميزانيتك، زد دخلك، خفض مصاريفك."
    },
    "f54": {
      "strength": "قدرتك على إدارة ديونك دون الحاجة للاقتراض لسدادها تدل على وعيك المالي.",
      "weakness": "استدانة لسداد ديون دوامة خطيرة. ابحث عن استشارة مالية متخصصة."
    },
    "f55": {
      "strength": "قدرتك على إدارة بطاقات الائتمان وعدم تراكم الديون عليها ممتازة.",
      "weakness": "بطاقات الائتمان أخطر أنواع الديون. سددها أولاً."
    },
    "f56": {
      "strength": "التزامك بتسديد فواتيرك في وقتها يدل على مسؤوليتك المالية وانضباطك.",
      "weakness": "استخدم التذكيرات على هاتفك. حدد يوماً شهرياً ثابتاً لتسديد الفواتير. التأخير يسبب غرامات ومشاكل."
    },
    "f57": {
      "strength": "عدم ترتب غرامات تأخير عليك يدل على التزامك وحسن تنظيمك.",
      "weakness": "الغرامات ضريبة عدم التنظيم. استخدم التذكيرات لتفاديها."
    },
    "f58": {
      "strength": "إدارتك الكفؤة لأموالك تدل على وعيك المالي العالي ومهاراتك التنظيمية.",
      "weakness": "ابدأ بخطوات بسيطة. إدارة الأموال مهارة تتعلم."
    },
    "f59": {
      "strength": "استخدامك للتطبيقات في إدارة أموالك يدل على وعيك التكنولوجي والمالي.",
      "weakness": "جرب تطبيق Money Manager أو Wallet. جدّد مصاريفك."
    },
    "f60": {
      "strength": "متابعتك الدائمة لمصاريفك وتسجيلها تدل على وعيك المالي وحرصك على عدم التبذير.",
      "weakness": "سجل مصاريفك يومياً. هذه عادة الناجحين مالياً."
    },
    "f61": {
      "strength": "معرفتك الدقيقة بمصروفاتك تدل على وعيك المالي وتنظيمك.",
      "weakness": "سجل كل مصروف لمدة شهرستعرف أين تذهب أموالك."
    },
    "f62": {
      "strength": "عدم استغرابك من مصاريفك يدل على متابعتك الدقيقة لأموالك.",
      "weakness": "ابدأ بالتسجيل اليومي. الاستغراب معناه أنك لا تخطط."
    },
    "f63": {
      "strength": "قلة ندمك على مشترياتك يدل على حكمتك في الاختيار.",
      "weakness": "فكر قبل الشراء. الندم علامة على الشراء الاندفاعي."
    },
    "f64": {
      "strength": "قدرتك على مقاومة شراء ما لا تحتاج يدل على نضجك المالي.",
      "weakness": "بعْه أو تبرع به. ما لا تستعمله هدر."
    },
    "f65": {
      "strength": "عادة مقارنة الأسعار والبحث عن أفضل العروض تدل على ذكائك المالي.",
      "weakness": "دقيقة واحدة قد توفر 10%. قارن قبل الشراء."
    },
    "f66": {
      "strength": "بحثك عن العروض والتخفيضات يدل على حرصك على أموالك وذكائك المالي.",
      "weakness": "العروض مغناطيس. لا تشترِ لمجرد أن عليه عرضاً."
    },
    "f67": {
      "strength": "توازنك في شراء الماركات يدل على وعيك وعدم اندفاعك.",
      "weakness": "ادفع ثمن الجودة لا الاسم. الماركات تدفع ثمن الاسم."
    },
    "f68": {
      "strength": "وعيك بأهمية الجودة وعدم شراء المقلد يدل على نضجك.",
      "weakness": "اختر الجودة حتى لو أقل شهرة. التقليد مؤقت."
    },
    "f69": {
      "strength": "تركيزك على الجودة وليس الماركة يدل على وعيك ونضجك.",
      "weakness": "اقرأ التقييمات. العلامة التجارية لا تعني الجودة دائماً."
    },
    "f70": {
      "strength": "تقييمك لقيمة المنتج مقابل سعره يدل على ذكائك المالي.",
      "weakness": "قيمة المنتج = الفائدة ÷ السعر. لا تشترِ لمجرد أن السعر منخفض أو مرتفع. اسأل: هل يستحق هذا السعر؟"
    },
    "f71": {
      "strength": "استغناؤك عن الاقتراض من الناس يدل على استقلالك المالي.",
      "weakness": "حاول أن تعيش في حدود دخلك. الاقتراض عادة خطيرة."
    },
    "f72": {
      "strength": "كرمك وإقراضك للآخرين يدل على طيبة قلبك، لكن احذر من التأثير على العلاقات.",
      "weakness": "اقرض فقط ما تستطيع خسارته. إقراض المال قد يخسرك صديقاً."
    },
    "f73": {
      "strength": "قدرتك على طلب أموالك بأدب دون حرج تدل على ثقتك بنفسك.",
      "weakness": "قل: عندي ظرف وأحتاج مالي. طلب دينك حق، لا تخجل."
    },
    "f74": {
      "strength": "ردك للأموال التي اقترضتها في وقتها يدل على أمانتك ومسؤوليتك.",
      "weakness": "رد الدين أمانة. لا تؤخره إذا قدرت."
    },
    "f75": {
      "strength": "قدرتك على طلب حقك دون خجل أو تردد تدل على ثقتك بنفسك.",
      "weakness": "تعلم أن تطلبه بأدب. الاستحياء في طلب الحق يضيع حقك."
    },
    "f76": {
      "strength": "قدرتك على رفض طلب الاقتراض بلطف عند الضرورة تدل على حكمتك.",
      "weakness": "قل: ظروفي لا تسمح. قول لا للإقراض يحفظ مالك وعلاقتك."
    },
    "f77": {
      "strength": "قدرتك على إدارة توقعات الناس المالية منك تدل على حكمتك ووضوحك.",
      "weakness": "ضع حدوداً مالية واضحة مع الناس. هذا يمنع سوء الفهم."
    },
    "f78": {
      "strength": "حديثك المفتوح مع شريكك عن الأمور المالية يدل على علاقة صحية وناضجة.",
      "weakness": "حددوا اجتماعاً شهرياً للمال. الحديث عن المال ضروري."
    },
    "f79": {
      "strength": "شفافيتك المالية مع شريكك تبني الثقة وتقوي العلاقة.",
      "weakness": "أخفاء المال يبني شكوكاً. الشفافية تبني الثقة."
    },
    "f80": {
      "strength": "صراحتك المالية مع شريكك وعدم إخفائك لأي أمر يدل على نزاهتك.",
      "weakness": "واجه مخاوفك وتحدث. إخفاء المال خيانة للثقة."
    },
    "f81": {
      "strength": "اتفاقك مع شريكك على نظام الحسابات المناسب لكما يدل على توافقكما.",
      "weakness": "اتفقا على ما يناسبكما. لا يوجد حل واحد يناسب الجميع."
    },
    "f82": {
      "strength": "اتفاقك مع شريكك على إدارة المصاريف يمنع الخلافات ويقوي العلاقة.",
      "weakness": "ناقشا الأولويات معاً. الاتفاق يمنع الخلافات."
    },
    "f83": {
      "strength": "قدرتك على إدارة الاختلافات المالية مع شريكك تدل على نضجكما.",
      "weakness": "حله بالحوار. الاختلاف على المال طبيعي."
    },
    "f84": {
      "strength": "قدرتك على الفصل بين المال والعلاقة ومنع الخلافات المالية يدل على نضجكما.",
      "weakness": "طريقة التعامل معه هي السبب. المال ليس السبب."
    },
    "f85": {
      "strength": "وجود أهداف مالية مشتركة مع شريكك يوحد جهودكما ويقوي العلاقة.",
      "weakness": "الأهداف المشتركة توحد الجهود وتقوي العلاقة."
    },
    "f86": {
      "strength": "تخطيطكما للمستقبل معاً يدل على شراكتكما القوية وتوافقكما.",
      "weakness": "التخطيط معاً يبني حلماً مشتركاً."
    },
    "f87": {
      "strength": "ادخاركما معاً يدل على تعاونكما وتفكيركما المشترك في المستقبل.",
      "weakness": "الادخار المشترك متعة وتحدي."
    },
    "f88": {
      "strength": "استثماركما معاً يدل على شراكتكما القوية وتفكيركما طويل المدى.",
      "weakness": "الاستثمار المشروع يضاعف العائد ويقوي الشراكة."
    },
    "f89": {
      "strength": "تقارب وعيكما المالي يمنع صراعات كثيرة ويسهل التفاهم.",
      "weakness": "تقارب الوعي المالي يمنع صراعات كثيرة."
    },
    "f90": {
      "strength": "تعلمكما معاً للأمور المالية يدل على حرصكما على تطوير وعيكما المالي.",
      "weakness": "اشتركا في دورة معاً. تعلم المالية مع بعض ممتع ومفيد."
    },
    "f91": {
      "strength": "حديثكما المفتوح عن المال يدل على علاقة صحية وناضجة.",
      "weakness": "التحدث عنه بصراحة يبني علاقة صحية. المال ليس عيباً."
    },
    "f92": {
      "strength": "انفتاحكما على الحديث عن المال يدل على نضج علاقتكما.",
      "weakness": "كسروا هذا الحاجز. تحريم الحديث عن المال سم للعلاقة."
    },
    "f93": {
      "strength": "قدرتكما على حل الصراعات المالية بهدوء يدل على نضجكما.",
      "weakness": "جلسات صريحة ومنتظمة تحلها."
    },
    "f94": {
      "strength": "قدرتكما على حل الخلافات المالية بهدوء وحكمة تدل على نضجكما.",
      "weakness": "حوار لا حرب."
    },
    "f95": {
      "strength": "استعانتكما بمتخصص مالي يدل على حكمتكما ورغبتكما في التخطيط السليم.",
      "weakness": "يوفر وقتك ومالك."
    },
    "f96": {
      "strength": "وجود خطة مالية للزواج يدل على تخطيطكما الجيد ووعيكما.",
      "weakness": "ناقشاها قبل الزواج. ضرورية."
    },
    "f97": {
      "strength": "تخطيطكما المالي للمرحلة ما بعد الزواج يدل على نظرتكما للمستقبل.",
      "weakness": "تحتاج مراجعة دورية وتعديل."
    },
    "f98": {
      "strength": "تفكيركما في التقاعد والتخطيط له يدل على وعيكما وبعد نظركما.",
      "weakness": "لا تنتظر حتى تكبر. التخطيط يبدأ اليوم."
    },
    "f99": {
      "strength": "وجود خطة للطوارئ المالية يدل على استعدادكما وحكمتكما.",
      "weakness": "صندوق طوارئ + تأمين مناسب."
    },
    "f100": {
      "strength": "استقلالك المالي هو ثمرة تخطيطك واجتهادك. تهانينا على هذا الإنجاز.",
      "weakness": "ابدأ بخطوات صغيرة وستصل."
    },
    "t1": {
      "strength": "قدرتك على التعبير عن احتياجاتك بوضوح ودون تردد تجنبك سوء الفهم وتجعل علاقاتك أكثر صحة ووضوحاً.",
      "weakness": "استخدم نموذج أنا الثلاثي: أنا أشعر بـ المشاعر عندما تفعل السلوك لأن السبب. مثال: أنا أشعر بالإهمال عندما لا تستمع لي لأنني أحتاج للتقدير."
    },
    "t2": {
      "strength": "استماعك للآخرين دون مقاطعة واحترامك لحديثهم يجعلهم يشعرون بالتقدير والاحترام.",
      "weakness": "درب نفسك على العد حتى 3 في ذهنك بعد أن ينتهي المتحدث من كلامه، ثم ابدأ بالرد. هذا يمنحه مساحة كاملة."
    },
    "t3": {
      "strength": "هدوء أسلوبك ولين كلامك يمنحك حضوراً قوياً ويجعل كلامك مسموعاً ومؤثراً في الآخرين.",
      "weakness": "الهدوء قوة. قبل أن تبدأ بالحديث، خذ ثلاثة أنفاس عميقة. هذا يهدئ جهازك العصبي ويجعل صوتك أكثر استرخاءً."
    },
    "t4": {
      "strength": "قدرتك على رفض طلب لا ترغب فيه بطريقة محترمة ولطيفة هي مهارة تواصلية رائعة.",
      "weakness": "جرب صيغاً مختلفة للرفض اللطيف: أقدر دعوتك لكن لدي التزام آخر، هذا لا يناسب جدولي حالياً، أشكرك لكن لا أستطيع المساعدة هذه المرة."
    },
    "t5": {
      "strength": "وعيك بعدم توقع قراءة الأفكار من الآخرين يدل على نضجك.",
      "weakness": "لا تتوقع من أحد أن يفهمك دون كلام. عبر عن احتياجك بوضوح. الناس لا يقرأون الأفكار."
    },
    "t6": {
      "strength": "قدرتك على النقاش بدلاً من الهجوم تدل على نضجك ومهاراتك التواصلية.",
      "weakness": "الهدف من النقاش الفهم لا الانتصار. ابحث عن أرض مشتركة ونقاط اتفاق قبل الاختلاف."
    },
    "t7": {
      "strength": "احترامك لحدود الآخرين وعدم تخطيها يدل على نضجك وتقديرك للخصوصية.",
      "weakness": "قبل أن تطلب شيئاً من الآخر، اسأل نفسك: هل هذا الطلب سيشكل عبئاً عليه؟ احترام حدود الآخر يبدأ بالتفكير فيها أولاً."
    },
    "t8": {
      "strength": "قدرتك على إيصال وجهة نظرك بهدوء ووضوح تجعل الآخرين يستمعون لك ويحترمون رأيك.",
      "weakness": "قبل أن تتحدث، نظم أفكارك. اكتب النقاط الرئيسية التي تريد إيصالها. استخدم أمثلة بسيطة لتوضيح فكرتك."
    },
    "t9": {
      "strength": "استخدامك للغة جسد إيجابية يعزز تواصلك ويجعل كلامك أكثر تأثيراً.",
      "weakness": "لغة جسدك تتكلم قبل لسانك. ابتسم، انظر في العيون، استرخِ. هذا يبني الثقة."
    },
    "t10": {
      "strength": "تواصلك البصري مع المتحدث يظهر اهتمامك واحترامك له.",
      "weakness": "التواصل البصري يبني الثقة. انظر في عيون المتحدث 60-70% من الوقت، لا تحدق باستمرار."
    },
    "t11": {
      "strength": "صدق تعابير وجهك مع مشاعرك يجعلك شخصاً صادقاً وواضحاً.",
      "weakness": "حاول أن تكون تعابير وجهك متناغمة مع كلامك. هذا يزيد من مصداقيتك."
    },
    "t12": {
      "strength": "هدوء نبرة صوتك حتى في المواقف الصعبة يدل على تحكمك العاطفي وقوتك الداخلية.",
      "weakness": "سجل صوتك واستمع إليه. ستندهش كيف تسمع نفسك. تدرب على تعديل نبرتك لتبدو أكثر هدوءاً وثقة."
    },
    "t13": {
      "strength": "تحكمك في نبرة صوتك وعدم رفعه يدل على نضجك واحترامك للآخرين.",
      "weakness": "رفع الصوت يغلق العقول ولا يوصل لنتيجة. تدرب على التحدث بنبرة هادئة حتى في المواقف الصعبة."
    },
    "t14": {
      "strength": "قدرتك على التحكم في نبرة صوتك تدل على ذكائك العاطفي وتواصلك الفعّال.",
      "weakness": "عندما تشعر بالانفعال، توقف وخذ نفساً عميقاً قبل الرد. هذا يساعدك على التحكم في نبرة صوتك."
    },
    "t15": {
      "strength": "وعيك باختيار كلماتك بعناية يدل على حكمتك ورقي أخلاقك.",
      "weakness": "فكر قبل أن تتكلم. اسأل نفسك: هل كلامي صحيح، مفيد، لطيف، ضروري؟ إذا كانت الإجابة لا، فاصمت."
    },
    "t16": {
      "strength": "استخدامك للكلمات الإيجابية والتشجيعية يبني جواً من التفاؤل والمحبة حولك.",
      "weakness": "حاول استبدال الكلمات السلبية بإيجابية: بدل لا أستطيع، قل سأحاول. بدل هذا صعب، قل هذا تحدٍ."
    },
    "t17": {
      "strength": "وعيك بتجنب الكلمات السلبية يدل على نضجك وإيجابيتك.",
      "weakness": "الكلمات السلبية تهدم. حاول استبدالها بكلمات إيجابية. بدل لا أستطيع، قل سأحاول."
    },
    "t18": {
      "strength": "حرصك على عدم جرح الآخرين بكلامك يدل على رقي أخلاقك.",
      "weakness": "الجروح اللفظية تترك ندوباً. فكر قبل أن تتكلم. هل كلامك صحيح، مفيد، لطيف، ضروري؟"
    },
    "t19": {
      "strength": "دعمك للآخرين بكلامك يبني الثقة ويقوي العلاقات.",
      "weakness": "الدعم المعنوي: أنا معك، أثق فيك، كيف يمكنني مساعدتك؟ هذه الكلمات تصنع العجائب."
    },
    "t20": {
      "strength": "قدرتك على إيصال المعلومة ببساطة ووضوح تدل على فهمك العميق للموضوع.",
      "weakness": "استخدم قاعدة KISS: Keep It Simple. البساطة سر الإيصال. لا تعقد الأمور."
    },
    "t21": {
      "strength": "قدرتك على تبسيط الأمور وعدم تعقيدها تدل على وضوح فكرك.",
      "weakness": "إذا لم تستطع شرح شيء ببساطة، فأنت لم تفهمه جيداً. تبسيط الأفكار مهارة."
    },
    "t22": {
      "strength": "استخدامك للأمثلة والقصص يجعل كلامك حياً وسهل التذكر.",
      "weakness": "الأمثلة والقصص تجعل كلامك حياً وسهل التذكر. استخدمها دائماً."
    },
    "t23": {
      "strength": "حرصك على التأكد من فهم الآخر لك يمنع سوء الفهم ويبني تواصلاً صحياً.",
      "weakness": "في حوارك القادم، استخدم عبارة: إذاً أنت تقصد أن ... وكرر ما فهمته. هذا بسيط لكنه فعال."
    },
    "t24": {
      "strength": "سؤالك الدائم إن كان كلامك واضحاً يدل على حرصك على الفهم المشترك.",
      "weakness": "بعد أن تشرح فكرة مهمة، اسأل: هل كلامي واضح؟ واطلب من الآخر إعادة ما فهمه."
    },
    "t25": {
      "strength": "طلبك إعادة الصياغة للتأكد من الفهم يدل على حرصك على التواصل الدقيق.",
      "weakness": "إعادة الصياغة تبين أنك مهتم حقاً بفهم الآخر. جربها اليوم: إذاً ما فهمت من كلامك أنك تشعر بـ ... هل هذا صحيح؟"
    },
    "t26": {
      "strength": "تلخيصك للنقاط الرئيسية في النقاش يؤكد الاتفاق ويمنع الالتباس.",
      "weakness": "التلخيص في نهاية النقاش يؤكد الاتفاق ويمنع الالتباس. إذاً اتفقنا على أن..."
    },
    "t27": {
      "strength": "تدوينك للنقاط المهمة يدل على تنظيمك وحرصك على الدقة.",
      "weakness": "الكتابة تثبت المعلومات. دوّن النقاط المهمة، خاصة في الاجتماعات والنقاشات المهمة."
    },
    "t28": {
      "strength": "ذاكرتك القوية واهتمامك بالتفاصيل يدلان على مسؤوليتك.",
      "weakness": "النسيان طبيعي. استخدم التذكيرات والمفكرة لحفظ الاتفاقات والمواعيد المهمة."
    },
    "t29": {
      "strength": "إعادتك صياغة كلام الطرف الآخر للتأكد من فهمك تدل على مهاراتك التواصلية.",
      "weakness": "إعادة الصياغة تبين أنك مهتم حقاً بفهم الآخر. جربها في الحوار القادم."
    },
    "t30": {
      "strength": "استخدامك لكلمات الشكر واللباقة يبني جسوراً من المحبة والاحترام.",
      "weakness": "الكلمة الطيبة صدقة. لو سمحت و شكراً يفتحان القلوب قبل الأبواب."
    },
    "t31": {
      "strength": "احترامك لحديث الآخرين وعدم مقاطعتهم يدل على أخلاقك العالية.",
      "weakness": "المقاطعة تقول: كلامي أهم من كلامك. درب نفسك على الصبر وعدم المقاطعة."
    },
    "t32": {
      "strength": "صبرك وعدم استعجالك المتحدث يدل على احترامك له.",
      "weakness": "دع الآخر يأخذ وقته في الكلام. الصمت أثناء حديثه ليس فراغاً، هو فرصة للتفكير والفهم العميق."
    },
    "t33": {
      "strength": "احترامك لمساحة المتحدث وعدم مقاطعته يدل على نضجك.",
      "weakness": "دع الآخر يعبر عن نفسه كاملاً. هذا يظهر احترامك له ولفكره."
    },
    "t34": {
      "strength": "أخذك وقتك في الرد يدل على حكمتك وتفكيرك المتأني.",
      "weakness": "ليس عليك الرد فوراً. الصمت القصير للتفكير علامة على الحكمة وليس التردد. قل: دعني أفكر قليلاً."
    },
    "t35": {
      "strength": "تفكيرك قبل الرد يحميك من كلمات قد تندم عليها. هذه من أهم مهارات التواصل.",
      "weakness": "فكر قبل أن تتكلم. اسأل نفسك: هل كلامي: صحيح، مفيد، لطيف، ضروري؟ إذا كانت الإجابة لا، فاصمت."
    },
    "t36": {
      "strength": "اتزانك وعدم تسرعك في الرد يدل على حكمتك.",
      "weakness": "الرد السريع قد تندم عليه. تنفس عميقاً قبل الرد، وخذ وقتك."
    },
    "t37": {
      "strength": "تحكمك في انفعالاتك عند الرد يدل على نضجك العاطفي.",
      "weakness": "إذا شعرت بالانفعال، قل: لنكمل هذا النقاش بعد قليل حين نهدأ. الانفعال يغلق العقول."
    },
    "t38": {
      "strength": "تحكمك في ردود أفعالك يدل على نضجك العاطفي وذكائك.",
      "weakness": "التحكم بالردود مهارة. درب نفسك على الرد بهدوء حتى لو كنت منزعجاً."
    },
    "t39": {
      "strength": "وعيك باحتياجك لوقت مستقطع وأخذه يدل على حكمتك.",
      "weakness": "الوقت المستقطع ليس هروباً. هو فرصة لترتيب الأفكار والتهدئة ثم العودة للحوار."
    },
    "t40": {
      "strength": "قدرتك على العودة للحوار بعد التهدئة تدل على نضجك ورغبتك في الحل.",
      "weakness": "العودة بعد التهدئة تظهر نضجك ورغبتك الحقيقية في الحل. لا تترك النقاش معلقاً."
    },
    "t41": {
      "strength": "وضوحك في التعبير عن مشاعرك يجنب الآخرين التخمين ويسهل التواصل.",
      "weakness": "استخدم كلمات محددة للتعبير عن مشاعرك: أنا فخور بك، أنا خائف من هذا الموقف، أنا سعيد بوجودك معي."
    },
    "t42": {
      "strength": "تعبيرك المباشر عن انزعاجك يساعد على حل المشكلة دون تراكمها.",
      "weakness": "أنا زعلان أسهل من انت بتزعلني. الأولى تعبر عن مشاعرك، الثانية تهاجم وتلوم."
    },
    "t43": {
      "strength": "تعبيرك عن سعادتك يضاعفها ويقوي علاقاتك مع الآخرين.",
      "weakness": "لا تبخل بالتعبير عن فرحتك. شاركها مع من تحب."
    },
    "t44": {
      "strength": "تعبيرك عن حبك للآخرين يدفئ قلوبهم ويقوي علاقاتك.",
      "weakness": "لا تبخل بكلمة أحبك. قلها اليوم لمن تحب. الكلمات لها تأثير سحري."
    },
    "t45": {
      "strength": "تعبيرك عن تقديرك للآخرين يبني علاقات قوية ويجعلهم يشعرون بقيمتهم.",
      "weakness": "التقدير كنز. لاحظ الأشياء الجميلة التي يفعلها الآخرون وقل لهم شكراً."
    },
    "t46": {
      "strength": "شكرك للناس يدل على تواضعك وتقديرك للجميل.",
      "weakness": "الشكر يزرع المحبة. اشكر الناس على صغرهم قبل كبرهم."
    },
    "t47": {
      "strength": "مدحك الصادق للآخرين يبني ثقتهم بأنفسهم ويقوي علاقتك بهم.",
      "weakness": "المدح الصادق يبني الثقة. امدح الأفعال لا الأشخاص فقط. عمل رائع بدل أنت رائع."
    },
    "t48": {
      "strength": "توازنك في النقد وعدم الإكثار منه يدل على حكمتك.",
      "weakness": "قبل أن تنتقد، اسأل نفسك: هل أنا مثالي؟ وهل انتقادي سيفيد أم سيؤذي؟"
    },
    "t49": {
      "strength": "نقدك البناء الذي يهدف للتطوير وليس للتجريح يدل على نضجك وحسن نيتك.",
      "weakness": "استخدم ساندويتش النقد: اذكر إيجابي، ثم النقد كفرصة للتطوير، ثم أنهِ بتشجيع. هذا جيد جداً، ويمكن أن يكون رائعاً لو أضفت... أنا واثق من قدرتك."
    },
    "t50": {
      "strength": "وعيك بتجنب النقد الهدام يدل على رقي أخلاقك.",
      "weakness": "النقد الهدام يهدم ولا يبني. ركز على السلوك لا الشخص. تأخرك أزعجني بدل أنت مهمل."
    },
    "t51": {
      "strength": "وضوحك في طلب ما تريد يسهل على الآخرين تلبيته وتجنبك الإحباط.",
      "weakness": "لا تتردد في طلب ما تريد بوضوح. التلميحات مربكة وقد لا يفهمها الآخرون."
    },
    "t52": {
      "strength": "وعيك بأن التلميحات ليست أفضل وسيلة للتواصل يدل على نضجك.",
      "weakness": "التلميحات مربكة. كن مباشراً وواضحاً في طلبك. هذا يوفر الوقت والجهد."
    },
    "t53": {
      "strength": "عدم انزعاجك من عدم فهم التلميحات يدل على تفهمك للآخرين.",
      "weakness": "لا تتوقع من أحد أن يفهم تلميحاتك. عبر عن احتياجك بوضوح. الناس لا يقرأون الأفكار."
    },
    "t54": {
      "strength": "مباشرتك في التعبير عن احتياجاتك تجنبك سوء الفهم وتوفر الوقت.",
      "weakness": "التعبير المباشر عن الاحتياجات أسهل وأوضح للجميع. تدرب عليه."
    },
    "t55": {
      "strength": "طلب المساعدة عند الحاجة يدل على وعيك وتواضعك.",
      "weakness": "طلب المساعدة ليس ضعفاً. هو وعي بقدراتك وحدودك. الناس تحب مساعدة الآخرين."
    },
    "t56": {
      "strength": "عرضك للمساعدة على الآخرين يدل على كرمك وإنسانيتك.",
      "weakness": "اعرض المساعدة بلطف: هل تريد مساعدة؟ بدل أنت محتاج مساعدة. الأول يعطي خياراً."
    },
    "t57": {
      "strength": "تقبلك للمساعدة من الآخرين يدل على تواضعك وانفتاحك.",
      "weakness": "تقبل المساعدة يمنح الآخر فرصة للعطاء ويقوي العلاقات. لا ترفض كل مساعدة."
    },
    "t58": {
      "strength": "اعترافك بعدم المعرفة يدل على صدقك وتواضعك.",
      "weakness": "الاعتراف بعدم المعرفة أفضل من التظاهر بالمعرفة. هذا يبني الثقة."
    },
    "t59": {
      "strength": "صراحتك بعدم الفهم وطلب التوضيح يدل على حرصك على الفهم الصحيح.",
      "weakness": "لا تخجل من قول لم أفهم. التعلم يحتاج تواضع. اسأل بهدوء: هل يمكنك التوضيح أكثر؟"
    },
    "t60": {
      "strength": "سؤالك عندما لا تفهم يدل على حرصك على الفهم الصحيح وتواضعك.",
      "weakness": "الأسئلة الجيدة تفتح أبواباً من الفهم. اسأل لتتعلم لا لتحرج."
    },
    "t61": {
      "strength": "حرصك على التأكد من فهمك الصحيح يدل على دقتك واهتمامك.",
      "weakness": "التأكد من الفهم يمنع سوء الفهم. استخدم عبارة: إذاً أنت تقصد أن..."
    },
    "t62": {
      "strength": "سرعة فهمك تدل على ذكائك وقدرتك على الاستيعاب.",
      "weakness": "الفهم السريع قد يكون سطحياً. خذ وقتك للفهم العميق، واسأل لتتأكد."
    },
    "t63": {
      "strength": "صبرك على التعلم وطلبك التوضيح يدل على إصرارك على الفهم.",
      "weakness": "كل إنسان يتعلم بطريقة مختلفة. لا بأس أن تطلب الشرح بطريقتك."
    },
    "t64": {
      "strength": "صبرك في شرح المعلومات للآخرين يدل على كرمك وتواضعك.",
      "weakness": "الصبر في الشرح يعكس احترامك للمتعلم. كرر بأسلوب مختلف إذا احتاج."
    },
    "t65": {
      "strength": "صبرك وعدم مللك من الشرح يدل على تحملك ورغبتك في مساعدة الآخرين.",
      "weakness": "إذا مللت من الشرح، جرب طريقة مختلفة. استخدم أمثلة، رسومات، أو قصص."
    },
    "t66": {
      "strength": "قدرتك على إقناع الآخرين تدل على مهاراتك التواصلية وفهمك للناس.",
      "weakness": "الإقناع يحتاج لفهم وجهة نظر الآخر أولاً. استمع جيداً، ثم اربط وجهة نظرك بما يهمه."
    },
    "t67": {
      "strength": "قدرتك على الإقناع تدل على مهاراتك التواصلية وفهمك للنفس البشرية.",
      "weakness": "الإقناع ليس معركة. شارك وجهة نظرك، قدم أدلتك، واترك للآخر حرية الاقتناع."
    },
    "t68": {
      "strength": "استخدامك للمنطق في كلامك يزيد من قوة حجتك ومصداقيتك.",
      "weakness": "استخدم المنطق في القرارات الكبيرة. اربط أفكارك بأدلة وأسباب واضحة."
    },
    "t69": {
      "strength": "استخدامك للعاطفة في كلامك يجعله أكثر تأثيراً وإنسانية.",
      "weakness": "العواطف مهمة، خاصة في العلاقات. لا تخف من التعبير عن مشاعرك."
    },
    "t70": {
      "strength": "توازنك بين العقل والعاطفة في كلامك يدل على نضجك وحكمتك.",
      "weakness": "استخدم عقلك لتحليل الموقف وقلبك لاختيار الأسلوب المناسب. التوازن هو المفتاح."
    },
    "t71": {
      "strength": "صدقك وابتعادك عن الكذب يدل على أمانتك ونزاهتك.",
      "weakness": "الكذب يهدم الثقة. حتى الكذبة البيضاء قد تكلفك كثيراً. الصدق أريح."
    },
    "t72": {
      "strength": "صدقك وقولك للحقيقة يبني ثقة الآخرين بك ويجعلك شخصاً نزيهاً.",
      "weakness": "قل الحقيقة ولو كانت مرة. الصدق يبني سمعة طيبة لك."
    },
    "t73": {
      "strength": "شجاعتك في قول الحقيقة حتى لو كانت صعبة تدل على نزاهتك وأخلاقك.",
      "weakness": "الصدق القاسي أفضل من الكذب اللطيف. لكن اختر أسلوباً لطيفاً لقولها."
    },
    "t74": {
      "strength": "صدقك وعدم مجاملتك على حساب الحقيقة يدل على نزاهتك.",
      "weakness": "المجاملة على حساب الصدق خداع للذات وللآخر. كن صادقاً ولبقاً في نفس الوقت."
    },
    "t75": {
      "strength": "صراحتك في قول رأيك تدل على ثقتك بنفسك ونزاهتك.",
      "weakness": "صراحتك لا تعني قسوتك. عبر عن رأيك باحترام، وذكر أن هذا رأيك الشخصي."
    },
    "t76": {
      "strength": "شجاعتك في قول رأيك دون خوف تدل على ثقتك بنفسك.",
      "weakness": "الخوف من إبداء الرأي يقتل شخصيتك. صوتك مسموع وقيم. عبر عنه بأدب."
    },
    "t77": {
      "strength": "جرأتك في التحدث أمام مجموعة تدل على ثقتك بنفسك ومهاراتك الاجتماعية.",
      "weakness": "ابدأ بالتحدث في مجموعات صغيرة وآمنة، مع أصدقائك أو عائلتك. كل تجربة ناجحة تبني ثقتك."
    },
    "t78": {
      "strength": "حكمتك في اختيار الصمت المناسب تدل على نضجك.",
      "weakness": "الصمت الزائد قد يفهم خطأً. ابدأ بالمشاركة بتعليقات بسيطة، ثم زد تدريجياً."
    },
    "t79": {
      "strength": "قدرتك على التغلب على رهبة التحدث أمام الناس تدل على ثقتك.",
      "weakness": "الرهبة طبيعية. ابدأ بالتحدث في مجموعات صغيرة، تدرب على ما ستقوله، ركز على الرسالة لا على نفسك."
    },
    "t80": {
      "strength": "قدرتك على التحدث أمام مجموعة تدل على ثقتك بنفسك ومهاراتك.",
      "weakness": "جهز نفسك جيداً قبل التحدث. اعرف موضوعك، تدرب عليه، وثق بأن لديك ما يستحق الاستماع."
    },
    "t81": {
      "strength": "قدرتك على قيادة النقاش تدل على مهاراتك القيادية والتواصلية.",
      "weakness": "قيادة النقاش مهارة. ابدأ بتوجيه الأسئلة، تلخيص الأفكار، ودعوة الجميع للمشاركة."
    },
    "t82": {
      "strength": "قدرتك على تهدئة النقاشات المحتدمة تدل على ذكائك الاجتماعي.",
      "weakness": "استخدم الدعابة اللطيفة، ذكر الجميع بالهدف المشترك، أو اقترح استراحة قصيرة."
    },
    "t83": {
      "strength": "لباقتك في تغيير موضوع النقاش تدل على ذكائك الاجتماعي.",
      "weakness": "تغيير الموضوع بلباقة يحتاج مهارة. استخدم جمل انتقالية: هذا يذكرني بـ... أو بالمناسبة، ماذا عن..."
    },
    "t84": {
      "strength": "لباقتك في إنهاء النقاش تدل على احترامك للآخرين وذكائك الاجتماعي.",
      "weakness": "استخدم عبارات لبقة للإنهاء: كان حديثاً ممتعاً، شكراً لك، للأسف يجب أن أذهب الآن، نتحدث لاحقاً."
    },
    "t85": {
      "strength": "مبادرتك ببدء النقاش في الموضوعات المهمة تدل على شجاعتك ووضوحك.",
      "weakness": "ابدأ بأسئلة مفتوحة: ما رأيك في...؟ كيف كان يومك؟ هل لديك وقت للتحدث عن...؟"
    },
    "t86": {
      "strength": "قدرتك على كسر الجمود في المواقف الاجتماعية تدل على ثقتك ومهاراتك.",
      "weakness": "استخدم سؤالاً بسيطاً، مجاملة لطيفة، أو ملاحظة عن الموقف الحالي. الجو لطيف اليوم، أليس كذلك؟"
    },
    "t87": {
      "strength": "قدرتك على فتح مواضيع جديدة للنقاش تدل على ثقافتك واهتماماتك المتنوعة.",
      "weakness": "اقرأ وتابع الأخبار والأحداث. كلما زادت معرفتك، زادت المواضيع التي يمكنك فتحها."
    },
    "t88": {
      "strength": "قدرتك على إعادة إحياء النقاش تدل على مهاراتك التواصلية.",
      "weakness": "استخدم أسئلة متابعة: ماذا حدث بعد ذلك؟ وكيف كان شعورك؟ وما رأيك في...؟"
    },
    "t89": {
      "strength": "تركيزك في النقاش يدل على احترامك للمتحدث واهتمامك بالموضوع.",
      "weakness": "تخلص من المشتتات. أغلق هاتفك، انظر في عيون المتحدث، وركز على ما يقوله."
    },
    "t90": {
      "strength": "قدرتك على البقاء مركزاً في النقاش تدل على انضباطك الذهني.",
      "weakness": "إذا شعرت بالشرود، أعد نفسك للحظة. اعتذر بلطف واطلب إعادة الفكرة: آسف، شرَد فكري قليلاً، هل يمكنك إعادة ما قلته؟"
    },
    "t91": {
      "strength": "تركيزك مع المتحدث يظهر احترامك واهتمامك.",
      "weakness": "أظهر اهتمامك بلغة جسدك: انظر في عينيه، أومئ برأسك، واستخدم كلمات تشجيعية: أفهم، تابع."
    },
    "t92": {
      "strength": "قدرتك على التركيز وعدم التشتت تدل على انضباطك الذهني.",
      "weakness": "درب نفسك على التركيز بتمارين التأمل. ابدأ بدقيقتين يومياً وركز على أنفاسك فقط."
    },
    "t93": {
      "strength": "احترامك للآخرين بعدم استخدام الهاتف أثناء التحدث يدل على رقي أخلاقك.",
      "weakness": "الهاتف عدو التواصل. اتركه جانباً عندما تتحدث مع أحد. هذا يظهر احترامك."
    },
    "t94": {
      "strength": "احترامك للآخرين وعدم النظر إلى هاتفك أثناء حديثهم يدل على أخلاقك.",
      "weakness": "النظر للهاتف أثناء حديث الآخرين وقاحة. ضعه في جيبك وركز مع من أمامك."
    },
    "t95": {
      "strength": "احترامك لوقت الآخرين يدل على رقي أخلاقك وتقديرك لهم.",
      "weakness": "لا تطيل في الحديث. لاحظ إشارات الملل من الآخرين، واختصر إذا لاحظت عدم التركيز."
    },
    "t96": {
      "strength": "وعيك بعدم الإطالة في الكلام يدل على احترامك لوقت الآخرين.",
      "weakness": "الإطالة تسبب الملل. ركز على النقاط الرئيسية فقط، ولاحظ تفاعل المستمع معك."
    },
    "t97": {
      "strength": "قدرتك على الاختصار مع إيصال الفكرة تدل على مهاراتك التواصلية.",
      "weakness": "الاختصار مهارة. تدرب على إيصال الفكرة في جملة أو جملتين. الخلاصة هي..."
    },
    "t98": {
      "strength": "قدرتك على إيصال الفكرة بكلمات قليلة تدل على وضوح فكرك.",
      "weakness": "قبل أن تتحدث، حدد الفكرة الرئيسية التي تريد إيصالها. عبر عنها بوضوح ثم توقف."
    },
    "t99": {
      "strength": "حكمتك في الاستماع أكثر من التحدث تمنحك فهماً أعمق للناس.",
      "weakness": "حاول في المحادثات القادمة أن تجعل هدفك فهم الآخر، وليس التحدث. اسأل أسئلة واستمع للإجابات بانتباه."
    },
    "t100": {
      "strength": "كونك مستمعاً جيداً يجعلك شخصاً محبوباً وموثوقاً به.",
      "weakness": "الاستماع الجيد: انظر في عيون المتحدث، لا تقاطع، اسأل أسئلة توضيحية، وأظهر اهتمامك بلغة جسدك."
    }
  }
}
